Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/deegree_quickstart.po
Languages: de

source: deegree is a Java application for serving maps (and vector data) for other clients to show.
de: deegree ist eine Java-Applikation für die Bereitstellung von Karten (und Vektordaten), damit diese von anderen Clients dargestellt werden können.

source: This Quick Start describes how to:
de: Diese Kurzanleitung beschreibt:

source: start deegree webservices
de: Starten von deegree Webservices

source: configure deegree webservices via the deegree services console
de: Konfigurieren von deegree Webservices über die deegreee Services Console

source: use the *deegree-inspire-workspace* as a starting point
de: Verwendung des *deegree-inspire-workspace* als Ausgangspunkt

source: Project description
de: Projektbeschreibung

source: *deegree* is open source software for spatial data infrastructures and the geospatial web.
de: *deegree* ist Open-Source-Software für Geodateninfrastrukturen und das Geospatial Web.

source: Available components are:
de: Verfügbare Komponenten sind:

source: This quickstart describes how to:
de: Diese Kurzanleitung beschreibt:

source: Start *deegree 3 webservices* on the Live DVD
de: Starten der *deegree 3 Webservices* auf der Live DVD

source: Use the *deegree 3 services console* to activate example configurations
de: Verwendung der *deegree 3 Services Console*, um die Beispielkonfigurationen zu aktivieren

source: Find more information
de: Mehr Informationen

source: About deegree 3
de: Über deegree 3

source: *deegree 3* is the new generation of the deegree Java framework for GIS applications and OGC-service implementations. It can be used to build web-based geospatial-data-infrastructures (GDI).
de: *deegree 3* ist die neue Generation des deegree Java-Frameworks für GIS-Anwendungen und OGC-Service-Implementierungen. deegree kann verwendet werden, um web-basierte Geodateninfrastrukturen (GDI) zu bauen.

source: Start deegree 3 webservices
de: Starten von deegree 3 Webservices

source: Choose *'Start deegree'* from the :menuselection:`Geospatial --> Web Services --> deegree` menu. The application will take a few moments to start up.
de: Wähle *'Start deegree'* aus der :menuselection:`Geospatial --> Web Services --> deegree` menu. Die Anwendung ist nach kurzer Zeit gestartet.

source: When you start *deegree* for the first time, firefox should open (otherwise open it manually and point your browser to http://localhost:8033). Please wait until you can see the *deegree 3 services console*. This is a simple web-based GUI for editing the configuration files of the so-called *deegree workspace*.
de: Beim Starten von * Deegree * zum ersten Mal Firefox sollte geöffnet werden (ansonsten manuell öffnen und zeigen Sie Ihren Browser auf Http://localhost:8033). Bitte warten Sie, bis du siehst die * Deegree 3 Service-Konsole *. Dies ist eine einfache Web-basierte GUI für die Bearbeitung der Konfigurationsdateien der sogenannten * Deegree Arbeitsbereich *.

source: deegree 3 workspaces
de: Deegree 3 Arbeitsbereiche

source: *deegree 3* uses configurations conformant to all *deegree 3* based webservices. Those configurations are stored in the so called workspace.
de: * Deegree 3 * nutzt Konfigurationen konform zu allen * Deegree 3 * basierte Webservices. Diese Konfigurationen sind im so genannten Arbeitsbereich gespeichert.

source: Inside the *deegree services console* you find a section to manage the included and ready-to-use workspaces. To enter this section, click on *'workspaces'* on the left side.
de: Im Inneren der * Deegree-Dienste-Konsole * finden Sie einen Abschnitt, der im Preis inbegriffen und Ready-to-Use Arbeitsbereiche verwalten. Um diesen Abschnitt zu gelangen, klicken Sie auf * "Arbeitsbereiche" * auf der linken Seite.

source: You are now in the workspace management of the running *deegree* instance. You can see which workspace is currently active (only one can be active at a time) workspace, inactive locally available workspaces and offical workspaces which can be imported if you have a internet connection.
de: Du bist jetzt in der Workspace-Management der laufenden * Deegree * Instanz. Sie können sehen, welcher Arbeitsbereich gerade aktiv ist (nur eine zu einem Zeitpunkt aktiv sein kann) Arbeitsbereich, inaktive lokal verfügbare Arbeitsbereiche und offizielle Arbeitsbereiche, die importiert werden können, wenn Sie eine Internetverbindung haben.

source: Please start the *deegree-inspire-workspace* now.
de: Bitte starten Sie die * Deegree-inspirieren-Arbeitsbereich * jetzt.

source: deegree 3 workspaces on OSGeoLive GIS Disc
de: Deegree 3 Arbeitsbereiche auf OSGeoLive GIS Disc

source: *deegree-workspace-inspire*
de: * Deegree-Arbeitsbereich-inspirieren *

source: This workspace includes an example configuration for INSPIRE View- and Download-Services. It consists of a transactional WFS (2.0.0 and 1.1.0) for all Annex I Data Themes and a WMS (1.3.0 and 1.1.1) which serves three layers of those Annex I Data Themes. Included are some harmonized dutch administrative units, cadastral parcels and addresses. The WFS in this example acts as an INSPIRE Download service (direct access) and outputs valid, harmonized INSPIRE GML. Additionally it supports multiple request types and queries.
de: In diesem Workspace berfindet sich eine Beispielkonfiguration für INSPIRE View- und Download-Services. Er besteht aus einem transaktionalen WFS (2.0.0 und 1.1.0) für alle Annex I Datenthemen und einem WMS (1.3.0 und 1.1.1), der alle drei Layer der Annex I Datenthemen anbietet. Enthalten sind einige harmonisierte niederländische administrative units, cadastral parcels und addresses. Der WFS fungiert in diesem Beispiel als ein INSPIRE Download-Service (direct access) und gibt valides, harmonisiertes INSPIRE GML zurück. Zusätzlich unterstützt er mehrere Request Typen und Queries.

source: This workspace loads harmonized INSPIRE GML from local files. This can easily changed to PostGIS, Oracle Spatial or Microsoft SQL Server as backend.
de: Dieser Workspace lädt harmonisiertes INSPIRE GML aus lokalen Dateien. Das Backend kann leicht zu PostGIS, Oracle Spatial oder Microsoft SQL Server geändert werden.

source: After activating the *deegree-workspace-inspire* you can open a simple map-client by clicking on *'see layers'*. The service is configured to visualize the data and a basemap (rendered by `OpenStreetMap <http://openstreetmap.org/>`_).
de: Nach der Aktivierung der * Deegree-Arbeitsbereich-inspirieren * Sie können einen einfache Karte-Client öffnen, indem Sie auf * 'finden Sie unter Ebenen' *. Der Dienst ist so konfiguriert, dass um die Daten und eine Grundkarte (dargestellt durch 'OpenStreetMap < http://openstreetmap.org/ >' _) zu visualisieren.

source: A click on the **+** on the right side opens a layer tree showing all available layers. You can activate the INSPIRE layer served by the deegree WMS here.
de: Ein Klick auf die ** + ** auf der rechten Seite öffnet eine Folienbaum zeigt alle verfügbare Ebenen. Sie können durch die Deegree-WMS hier serviert INSPIRE-Layer aktivieren.

source: The map client is based on `OpenLayers <http://openlayers.org/>`_. You can pan through the map holding the left mouse button and drag the map. Zooming is possible via mouse wheel or the navigation elements on the left side.
de: Der Karten-Client basiert auf `OpenLayers <http://openlayers.org/>`_. Durch das Halten der linken Maustaste und Ziehen der Karte kann über die Karte navigiert werden. Zoomen erfolgt via Mausrad oder über die Navigationselemente auf der linken Seite.

source: More information and step-by-step tutorials about the INSPIRE workspace can be found in the deegree `documentation <http://download.deegree.org/documentation/3.3.20/html/lightly.html#example-workspace-1-inspire-network-services>`_.
de: Weitere Informationen und Schritt für Schritt Anleitungen über den INSPIRE-Arbeitsbereich finden Sie in der Deegree 'Dokumentation < http://download.deegree.org/documentation/3.3.20/html/lightly.html#example-workspace-1-inspire-network-services >' _.

source: Want more?
de: Sind Sie neugierig auf mehr?

source: This was just a short intro on the features of deegree 3. There is more information in the demo installations and on the deegree website.
de: Dies war nur eine kurze Einführung zu den Funktionen von Deegree 3. Gibt es weitere Informationen in den Demo-Installationen und die Deegree-Website.

source: Available here: http://demo.deegree.org
de: Finden Sie hier: http://demo.deegree.org

source: deegree website
de: Deegree-Webseite

source: Available here: http://www.deegree.org
de: Finden Sie hier: http://www.deegree.org
