Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/mapbender_quickstart.po
Languages: de

source: An access to Mapbender requires authentication. Only public applications can be used by everyone.
de: Der Zugriff auf eine Mapbender-Anwendung benötigt Authentifizierung. Nur öffentliche Anwendungen können von allen Anwendern genutzt werden.

source: A user has permissions to access one or a set of applications and services.
de: Ein Benutzer kann die Berechtigungen bekommen, um auf eine oder mehrere Anwendungen und Dienste zuzugreifen.

source: Create a user
de: Benutzer anlegen

source: To create a user go to :guilabel:`New User` or click the :menuselection:`+-Button`.
de: Um einen Benutzer anzulegen, gehen Sie zu :guilabel:`New User` oder wählen Sie den :menuselection:`+-Button`.

source: Choose a name and a password for your user.
de: Wählen Sie einen Namen und ein Kennwort für Ihren Benutzer.

source: Provide an email address for the user.
de: Geben Sie eine E-Mail-Adresse für den Benutzer an.

source: Save your new user.
de: Speichern Sie Ihren neuen Benutzer.

source: You can provide more information about the user in the tab :menuselection:`Profile`.
de: Weitere Angaben zum Benutzer können im Reiter :menuselection:`Profil` erfolgen.

source: Create a group
de: Gruppe anlegen

source: Create a group by :guilabel:`New Group`.
de: Erzeugen Sie eine Gruppe über :guilabel:`New Group`.

source: Define a name and a description for your group.
de: Wählen Sie einen Namen und eine Beschreibung für Ihre Gruppe.

source: Save your new group.
de: Speichern Sie Ihre neue Gruppe.

source: Assign users to group
de: Benutzer einer Gruppe zuweisen

source: Assign a user to a group by :guilabel:`Users --> Groups`.
de: Weisen Sie einen Benutzer einer Gruppe über :guilabel:`Users --> Groups` zu.

source: Choose one or more users you want to add to the group at :menuselection:`Users`.
de: Wählen Sie einen oder mehrere Benutzer über :menuselection:`Users` aus, die Sie der Gruppe zuweisen wollen.

source: Assign a user by :menuselection:`Users --> Edit-Button--> Groups` to a group.
de: Weisen Sie einen Benutzer über :menuselection:`Users --> Edit-Button--> Groups` einer Gruppe zu.

source: Roles
de: Rechte

source: Mapbender provides different rights. They refer to the Symfony ACL System http://symfony.com/doc/2.8/cookbook/security/acl_advanced.html#built-in-permission-map
de: Mapbender bietet verschiedene Rechte an, die Sie vergeben können. Diese beruhen auf dem Symfony ACL System http://symfony.com/doc/2.8/cookbook/security/acl_advanced.html#built-in-permission-map

source: view - Whether someone is allowed to view the object.
de: Anzeigen (view) - Regelt, ob jemand das Objekt betrachten darf.

source: edit - Whether someone is allowed to make changes to the object.
de: Editieren (edit) - Regelt, ob jemand das entsprechende Objekt editieren darf.

source: delete - Whether someone is allowed to delete the object.
de: Löschen (delete) - Regelt, ob jemand das entsprechende Objekt löschen kann.

source: operator - Whether someone is allowed to perform all of the above actions.
de: Operator - Kann anzeigen, editieren und löschen.

source: master - Whether someone is allowed to perform all of the above actions, and in addition is allowed to grant any of the above permissions to others.
de: Master - Kann anzeigen, editieren und löschen und diese Rechte außerdem weitergeben.

source: owner - Whether someone owns the object. An owner can perform any of the above actions and grant master and owner permissions.
de: Besitzer - Darf alles. Darf master-Recht und owner-Recht vergeben.

source: Assign roles to a user by :menuselection:`Users --> Edit your User --> Security`.
de: Weisen Sie einem Benutzer über :menuselection:`Users --> Edit your User --> Security` Rechte zu.

source: Assign an Application to a User/Group
de: Zuweisen einer Anwendung zu einem Benutzer/einer Gruppe

source: Edit your application by :menuselection:`Application --> Edit-Button`.
de: Bearbeiten Sie Ihre Anwendung über :menuselection:`Application --> Edit-Button`.

source: Choose :menuselection:`Security`
de: Wählen Sie :menuselection:`Security`

source: Set permission like view edit delete operator master owner
de: Setzen Sie Berechtigungen wie anzeigen, editieren, löschen, operator, master, Besitzer.

source: Assign a user/group to the application
de: Weisen Sie eine Anwendung einem Benutzern / einer Gruppe zu

source: Test your configuration!
de: Testen Sie die Konfiguration!

source: Logout from Mapbender by :menuselection:`Logout`.
de: Melden Sie sich über :menuselection:`Logout` ab.

source: Login as the new user
de: Melden Sie sich unter der neuen Benutzerbezeichnung an

source: Things to try
de: Weitere Aufgaben

source: Here are some additional challenges for you to try:
de: Hier sind weitere Aufgaben, die Sie ausprobieren können:

source: Try to load some WMS in your application. Try to configure your WMS.
de: Versuchen Sie, einige WMS in Ihre Anwendung zu laden. Versuchen Sie Ihre WMS zu konfigurieren.

source: Try to create an individual application.
de: Versuchen Sie eine eigene Anwendung zu erzeugen.

source: What Next?
de: Was kommt als Nächstes?

source: This is only the first step on the road to using Mapbender. There is a lot more functionality you can try.
de: Dies waren nur die ersten Schritte mit Mapbender. Es gibt viele weitere Funktionen, die Sie ausprobieren können.

source: Mapbender Website
de: Mapbender Projektseite

source: You find tutorials at
de: Sie finden Tutorials unter

source: Get involved in the project
de: Beteiligen Sie sich

source: https://www.mapbender.org/Community
de: https://www.mapbender.org/?q=de/node/16
