Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/mapbender_quickstart.po
Languages: de

source: Mapbender is a web based geoportal framework to publish, register, view, navigate, monitor and grant secure access to spatial data infrastructure services.
de: Mapbender ist ein webbasiertes Geoportal-Framework zum Veröffentlichen, Registrieren, Anzeigen, Navigieren und Überwachen von Diensten, mit der Möglichkeit Dienste gesichert anzubieten.

source: You will need nothing but a standard web browser for this quickstart.
de: Für diesen Schnellstart benötigen Sie nichts weiter als einen Standard-Webbrowser.

source: This Quick Start describes how to:
de: Dieser Quickstart beschreibt, wie Sie:

source: start Mapbender
de: Mapbender starten

source: create an application
de: eine Anwendung erstellen

source: load a Web Map Service (OGC WMS)
de: einen Web Map Service (OGC WMS) laden

source: configure WMS
de: WMS konfigurieren

source: create an individual application
de: eine individuelle Anwendung erstellen

source: create a user and a group and assign applications to them
de: Benutzer und Gruppen anlegen und ihnen Anwendungen zuweisen

source: This is how a Mapbender application can look like:
de: Eine Mapbender Anwendung kann wie folgt aussehen:

source: For the installation of Mapbender have a look at https://doc.mapbender.org/en/installation.html.
de: Hinweise zur Installation von Mapbender finden Sie unter https://doc.mapbender.org/de/installation.html.

source: Start Mapbender
de: Mapbender starten

source: Choose :menuselection:`Geospatial --> Browser Clients --> Mapbender` from the start menu or visit http://localhost/mapbender/app.php
de: Wählen Sie :menuselection:`Geospatial --> Browser Clients --> Mapbender` aus dem Startmenü oder besuchen Sie http://localhost/mapbender/app.php

source: The application will take a few moments to start up
de: Die Anwendung braucht eine kurze Zeit, um zu starten.

source: If you have any difficulties running Mapbender, please check whether your Apache web server and your PostgreSQL database are running. Or if you use SQLite as database whether you have write access to the file.
de: Falls Sie Schwierigkeiten haben, Mapbender zu starten, überprüfen Sie ob der Apache Web Server und die PostgreSQL Datenbank laufen. Oder falls Sie SQLite als Datenbank verwenden, ob Sie Schreibrechte auf die Datei haben.

source: Start Mapbender in the developer mode app_dev.php
de: Starten Sie Mapbender im Entwicklungsmodus über app_dev.php

source: Symfony offers a developer mode with lot of information about your application (logging, exceptions, database queries, memory usage, time and more). This mode is only available from localhost.
de: Symfony bietet einen Entwicklungsmodus mit einer Reihe von Informationen über die Anwendung an (Logging, Fehlermeldungen, Datenbankabfragen, Speicherverbrauch, Zeit und mehr). Dieser Modus ist nur über localhost verfügbar.

source: Start the developer mode: http://localhost/mapbender/app_dev.php
de: Starten Sie Mapbender im Entwicklungsmodus über app_dev.php

source: Have a look at the information that is offered in the developer mode.
de: Schauen Sie sich an, welche Information im Entwicklungsmodus angezeigt werden.

source: Welcome page
de: Die Willkommensseite

source: The Welcome page lists applications that are public and can be used by all users. The applications are listed with a screenshot, a title and a description.
de: Die Willkommensseite listet die öffentlichen Anwendungen auf, die von allen Benutzern aufgerufen werden können. Diese Anwendungen werden mit Screenshot, Titel und Beschreibung aufgelistet.

source: You can open an application by click on the title, the screenshot or the start button.
de: Sie können die Anwendung per Klick auf den Titel, das Vorschaubild oder den Startbutton aufrufen.

source: Before you can administrate with Mapbender you have to login to get access to the administration.
de: Bevor Sie Mapbender administrieren können, müssen Sie sich mit einem Zugangsaccount anmelden.

source: Click on Login at right-top to open the login page.
de: Klicken Sie oben rechts auf Anmelden, um zum Login-Bereich zu gelangen.

source: You can login with the user that was generated on installation. It can be :guilabel:`root` and password :guilabel:`root` (This is the default user and password that you get after installation of Mapbender on OSGeoLive. Please change the root password if you want to run a productive environment. Please don't delete the user :guilabel:`root`.).
de: Sie können sich mit dem Benutzer anmelden, der während der Installation erzeugt wurde. Er kann :guilabel:`root` heißen mit dem Kennwort :guilabel:`root` (Dies ist die Standardbenutzer/Kennwort - Kombination nach der Installation von Mapbender auf der OSGeoLive. Bitte ändern Sie das Kennwort, wenn Sie eine Produktivumgebung betreiben. Löschen Sie den Benutzer :guilabel:`root` nicht.).

source: After successful login you are directed to the :guilabel:`Mapbender administration`.
de: Nach erfolgreicher Anmeldung werden Sie zur :guilabel:`Mapbender Administration` weitergeleitet.

source: Application overview
de: Anwendungsübersicht

source: After the login you are directed to the :guilabel:`Applications` with a list of applications you are allowed to access.
de: Nach der Anmeldung werden Sie zur Anwendungsübersicht (:guilabel:`Applications`) mit einer Liste von den für Sie freigegebenen Anwendungen weitergeleitet.

source: The Application overview provides the following functionality:
de: Die Anwendungsübersicht bietet folgende Funktionen:

source: title and description
de: Titel und Beschreibung

source: screenshot for the application (if provided)
de: Vorschaubild zur Anwendung (sofern bereitgestellt)

source: link to the application
de: Link zur Anwendung

source: button to duplicate the application
de: Button, um die Anwendung zu duplizieren

source: button to edit the application
de: Button, um die Anwendung zu bearbeiten

source: button to publish/unpublish the application
de: Button zur Veröffentlichung der Anwendung

source: button to delete the application
de: Button, um die Anwendung zu löschen

source: button to create a new application
de: Button, um eine neue Anwendung anzulegen

source: with the filter textfield you can search for applications
de: mit dem Filtertextfeld kann nach Anwendungen gesucht werden

source: Create an individual application
de: Erstellen Sie eine eigene Anwendung

source: Create a new application by providing basic information about your application. After that you use the edit mode to add elements, layers and security.
de: Erstellen Sie eine neue Anwendung, indem Sie einige grundlegende Informationen eingeben. Anschließend können Sie den Editiermodus verwenden, um Elemente, Layer und Sicherheitseinstellungen zu verwalten.

source: choose :menuselection:`Applications --> New Application`
de: Wählen Sie :menuselection:`Applications --> New Application`

source: define a title and description for your application
de: Geben Sie einen Titel und eine Beschreibung der Anwendung ein

source: define an URL title which will be used in the URL to open the application. It can be the same as the title
de: Geben Sie einen URL-Titel an, der in der URL benutzt wird, um die Anwendung zu starten. Er kann identisch zum Titel sein.

source: upload an image file as screenshot for the application overview
de: Laden Sie eine png-Datei hoch und definieren so ein Vorschaubild für die Anwendungsübersicht

source: choose a template for your application
de: Wählen Sie eine Layoutvorlage für die Anwendung

source: choose the button **Create** to create the application
de: Betätigen Sie die Schaltfläche **Create**, um die Anwendung zu erzeugen.

source: click the :menuselection:`Edit-Button` at the new application to edit the application
de: Gehen Sie zu :menuselection:`Bearbeitungs-Button` neben der Anwendung und wählen Sie die neue Anwendung aus.

source: your application is set up. Now you need a WMS to be displayed in your application. This will be described in the section **WMS Management**.
de: Ihre Anwendung wurde erstellt. Jetzt benötigen Sie Elemente (z. B. ein Kartenelement, Navigation, Legende) und Kartendienste. Diese werden im Abschnitt **WMS Management** beschrieben.

source: Please note, that the style-, icon- and layout configuration has to be done in css- and twig-files at the moment. Read more about template generation at https://doc.mapbender.org/en/customization/templates.html.
de: Beachten Sie, dass derzeit die Layout-, Icon- und Farbanpassungen in css- und twig-Dateien erfolgen. Lesen Sie dazu die Dokumentation unter https://doc.mapbender.org/de/customization/templates.html.

source: Copy or rename an application
de: Kopieren und Umbenennen einer Anwendung

source: You also can create a new application by copying an existing application. Every application with write access can be copied. It provides a button to duplicate the application with all the services. The new application will get a derived name which can be changed in the next step.
de: Sie können eine neue Anwendung auch durch Kopieren einer vorhandenen Anwendung erzeugen. Jede Anwendung, auf die Sie schreibend zugreifen können, lässt sich kopieren. Beim Kopieren wird die Anwendung mitsamt der zugehörigen Dienste dupliziert. Die neu entstehende Anwendung erhält einen abgeleiteten Namen, den Sie im nächsten Schritt anpassen können.

source: Delete an application
de: Löschen einer Anwendung

source: You can delete an application from the menu item :menuselection:`Applications` with the :menuselection:`x-button`.
de: Sie können eine Anwendung aus der Liste :menuselection:`Applications` über den :menuselection:`x-Button` löschen.

source: Export / Import applications and sources
de: Exportieren und Importieren von Anwendungen und Daten

source: You can export applications as JSON or YAML with :menuselection:`Applications --> Export`. You can choose one or more applications to export and you can also export the sources which are published in the applications.
de: Sie können eine Anwendung als JSON oder YAML über :menuselection:`Applications --> Export` exportieren. Für den Export können ein oder mehrere Anwendungen ausgewählt werden. Die Datenquellen können ebenfalls beim Export ausgegeben werden.

source: The exportfile contains all the definitions of the application/s (sources) and can be imported via :menuselection:`Applications --> Import` in another Mapbender3 installation or in the same installation.
de: Die Export-Datei beinhaltet alle Definitionen, die zum Aufbau der Anwendung (Datenquellen) erforderlich sind. Die Export-Datei kann über :menuselection:`Applications --> Import` in andere Mapbender-Installationen oder in die gleiche Installation geladen werden.

source: Management of Data Sources
de: Verwaltung von Datenquellen

source: Mapbender can handle OGC WMS. The administration provides an administration interface for the sources (at the moment only WMS).
de: Mapbender kann OGC WMS Dienste verwalten. Die Administration bietet für jede Quelle eine Administrationsoberfläche (im Moment lediglich WMS).

source: Service Repository overview
de: Datenquellen Überblick

source: Go to :guilabel:`Services` and have a look at the Service repository.
de: Gehen Sie auf :guilabel:`Services` und schauen sich die Datenquellen an.

source: You get an overview on the Sources that are loaded in your Mapbender.
de: Sie bekommen einen Überblick über die Dienste, die bereits in Mapbender geladen wurden.

source: Type, Title, Description offer first information about the services.
de: Typ, Titel und Beschreibung bieten eine erste Information über den Dienst.

source: On click on the button :menuselection:`View-Button` you get further information about the source.
de: Per Klick auf den :menuselection:`View-Button` bekommen Sie weitere Informationen über die Quelle.

source: With the button :menuselection:`Delete-Button` you can delete the source from your repository.
de: Über den :menuselection:`Delete-Button` können Sie die Datenquelle aus ihrem Repository löschen.

source: Loading Web Map Services
de: Laden von Web Map Services

source: You can load OGC Web Map Services (WMS) to your application.
de: Sie können OGC Web Map Services (WMS) in Ihre Anwendung laden.

source: A WMS returns an XML-file when the getCapabilities document is requested. This information is parsed by Mapbender and Mapbender gets all the necessary information about the service from this XML
de: Ein WMS liefert ein XML, wenn das getCapabilities-Dokument angefordert wird. Diese Information wird von Mapbender ausgelesen. Der Client erhält alle notwendigen Informationen über den Dienst aus diesem XML.

source: You should first check the Capabilities document in your browser before you try to load it with Mapbender
de: Sie sollten das Capabilities-Dokument zuerst in Ihrem Browser überprüfen, bevor Sie versuchen, den Dienst in Mapbender zu laden.

source: Choose menu item :menuselection:`Services --> Add Service` or use the +-Button. Link to the WMS getCapabilities URL in the text field :menuselection:`Serviceurl`.
de: Wählen Sie :menuselection:`Services --> Add Service`. Geben Sie den Link zur WMS-getCapabilities-URL in das Textfeld :menuselection:`Originurl` ein.

source: Enter username and password if your service needs authentication.
de: Geben Sie Nutzername und Kennwort ein, sofern der Dienst eine Authentifizierung benötigt.

source: Hit **Load** to load the Service to the repository.
de: Klicken Sie **Load**, um den Dienst in das Repository zu laden.

source: After successful registration of the service Mapbender will display an overview on the information that was provided by the service.
de: Nach erfolgreicher Registrierung des Dienstes zeigt Mapbender eine Übersicht der Informationen an, die der Dienst geliefert hat.

source: Here is a example WMS:
de: Beispiel für einen WMS

source: Add Service to Application
de: Fügen Sie Dienste zur Anwendung hinzu

source: After the successful upload of a WMS you want to add your WMS to an application.
de: Nach dem erfolgreichen Hochladen eines WMS möchten Sie diesen zu einer Anwendung hinzufügen.

source: Choose :menuselection:`Applications --> edit-Button --> Layers --> Edit-Button`.
de: Wählen Sie :menuselection:`Applications --> Edit-Button --> Layers --> Edit-Button`.

source: Click on the :menuselection:`+-button` to add a layerset, which represents a collection of layers (a possible name could be main)
de: Wählen Sie den :menuselection:`+-Button`, um ein Layerset hinzuzufügen. Ein Layerset präsentiert mehrere Layer (der Name ist frei wählbar z.B. main oder overview).

source: Now you can add layer to the layerset
de: Jetzt können Sie Dienste zum Layerset hinzufügen.

source: Click on the :menuselection:`+-button` at your new layerset to add a Service.
de: Wählen Sie den :menuselection:`+-Button`, um dem neuen Layerset Dienste hinzuzufügen.

source: You can change the order of the Services in your application by drag & drop.
de: Sie können die Reihenfolge der Dienste in Ihrer Anwendung über Drag & Drop ändern.

source: Configure your WMS
de: Konfiguration von Diensten

source: You can configure the WMS for your specific application. Maybe you don't want to provide all layers or you want to change the order or titles of the layer or disable the feature info or change the maxscale for a layer.
de: Sie können Dienste für Ihre Anwendung konfigurieren. Vielleicht möchten Sie nicht alle Ebenen anzeigen, oder Sie möchten die Reihenfolge oder den Titel der Ebenen ändern, die Info-Abfrage für einzelne Ebenen verhindern oder den Maximalmaßstab ändern.

source: Choose :menuselection:`Applications --> edit-Button --> Layers --> edit-Button` to configure the Service Instance.
de: Wählen Sie :menuselection:`Applications --> edit-Button --> Layers --> edit-Button`, um eine Instanz zu konfigurieren.

source: You will see a table with the layers of the Service.
de: Sie sehen eine Tabelle mit den Layern des Dienstes.

source: You can change the order of the layers via drag & drop
de: Sie können die Reihenfolge der Layer per Drag & Drop ändern.

source: Service configuration
de: Servicekonfiguration

source: format - choose the format for getMap-Requests
de: format - wählen Sie das Format für den getMap-Requests

source: infoformat - choose the format for getFeatureInfo-Requests
de: infoformat - wählen Sie das Format für getFeatureInfo-Requests

source: exceptionformat - choose the format for exceptions
de: exceptionformat - wählen Sie das Format für Fehlermeldungen

source: opacity - choose opacity in percent
de: opacity - wählen Sie die Opazität (Deckkraft) in Prozent

source: visible - default on. Service should be visible
de: visible - Standard ist aktiv. Dienst ist sichtbar

source: basesource - activated for services that should be administrated by BaseSourceSwitcher
de: basesource - aktiviert für Dienste, die vom BaseSourceSwitcher verwaltet werden sollten

source: proxy - if active the service will be requested by Mapbender and not directly
de: proxy - bei Aktivierung wird der Dienst über Mapbender als Proxy angefordert

source: tiled - you can request a WMS in tiles, default is not tiled (may be a good choice if your map is very big and the WMS service does not support the width/height)
de: tiled - Dienst wird in Kacheln angefordert, Standard ist nicht gekachelt (kann bei einer großen Karte sehr hilfreich sein, sofern der Dienst die Kartengröße nicht unterstützt)

source: Layer ordering - layer ordering can get switched in the application
de: Layerreihenfolge - die Ebenenreihenfolge kann in der Anwendung angepasst werden

source: Layer configuration
de: Layerkonfiguration

source: title - layer title from Service information
de: title - Layertitel der Service-Information

source: active (on/off) - enable/disable a layer for this individual application
de: active (on/off) - (de)aktiviert einen Layer in dieser Anwendung

source: select on - selectable in geodata explorer
de: Auswählen an (select on) - Layer ist bei Anwendungsstart aktiv

source: select allow - layer is active when the application starts
de: Auswählen erlauben (select allow) - Layer ist auswählbar im Ebenenbaum

source: info on - layer provides feature info requests, info default activates the feature info functionality
de: info on - Layer-Infoabfrage wird beim Start aktiviert

source: info allow
de: info allow - Infoabfrage wird für diesen Layer zugelassen

source: minscale / maxscale - the scale range in which the layer should be displayed, 0 means no scale limitation
de: minscale / maxscale - Definiert den Maßstabsbereich, in dem der Layer angezeigt wird. Tragen Sie nichts ein, um Maßstabsbegrenzungen zu umgehen

source: toggle - open folder on start of the application
de: toggle - Aufklappen beim Start der Anwendung

source: reorder - allows to reorder the layers with drag & drop while using the application
de: reorder - Ebenen können über Drag & Drop in der Anwendung verschoben werden

source: ... -> opens a dialog with more information
de: öffnet einen Dialog mit weiteren Informationen

source: name
de: name - Layername der Service Information (wird beim getMap-Request verwendet und ist nicht veränderbar)

source: style - if a WMS provides more than one style you can choose a different style than the default style
de: style - Wenn ein WMS mehr als einen Stil anbietet, können Sie einen anderen Stil als den default-Stil wählen.

source: Add Elements to your application
de: Fügen Sie Elemente zu Ihrer Anwendung hinzu

source: Mapbender offers a set of elements. You can add the elements to your application. You have different regions (Toolbar, Sidepane, Content, Footer) to which you can add elements.
de: Mapbender bietet eine Reihe von Elementen (Modulen) an. Ihre Anwendung verfügt wiederum über verschiedene Bereiche (Toolbar oben, Sidepane Seitenleiste links, Content, Footer unten), die Sie mit Elementen bestücken können.

source: Choose :menuselection:`Applications --> edit-Button --> Layers --> Button +` to get an overview over the elements Mapbender3 provides.
de: Wählen Sie :menuselection:`Applications --> edit-Button --> Layers --> +-Button`, um eine Übersicht über die Mapbender-Elemente zu erhalten.

source: Choose an element from the list.
de: Wählen Sie ein Element aus der Liste aus.

source: Notice that you have different areas in your application. Make sure to add the element to a region that makes sense.
de: Beachten Sie die verschiedenen Bereiche Ihrer Anwendung. Stellen Sie sicher, dass Sie das Element zum richtigen Bereich hinzufügen.

source: Configure the element. Notice: When you select an element for example **map** you see that the element has a set of attributes. Each element offers individual attributes for configuration.
de: Konfigurieren Sie das Element. Hinweis: Wenn Sie ein Element z. B. **map** auswählen, sehen Sie lediglich die Optionen für dieses Element und können es entsprechend konfigurieren.

source: You can change the position of the element via drag & drop
de: Sie können die Position der Elemente über Drag & Drop ändern.

source: Have a look at your application. Open your application from :menuselection:`Applications --> Applications Overview`
de: Schauen Sie sich Ihre Anwendung an. Öffnen Sie Ihre Anwendung über :menuselection:`Applications --> Applications Overview`

source: Now you should get an idea how easy it is to change a Mapbender application without changes in the code.
de: Inzwischen sollten Sie einen Einblick bekommen haben, wie einfach es ist, die Mapbender Anwendung anzupassen, ohne den Quellcode verändern zu müssen.

source: Examples for elements Mapbender3 offers:
de: Beispiele für Elemente, die Mapbender anbietet:

source: About Dialog
de: Über Mapbender-Dialog (About Dialog) - zeigt Informationen über Mapbender an

source: Activity Indicator
de: Aktivitätsanzeige

source: BaseSourceSwitcher
de: Hintergrund wechseln

source: Coordinates Display
de: Koordinatenanzeige

source: Coordinate Utility
de: Koordinatenwerkzeug

source: Legend
de: Legende

source: Layertree - Table of Content
de: Layertree - Ebenenbaum

source: Map
de: Karte

source: Overview
de: Übersicht

source: PrintClient
de: Druck

source: Ruler Line/Area
de: Linien- und Flächenmessung

source: Scale Selector
de: Maßstabsauswahl

source: ScaleBar
de: Maßstabsleiste

source: SimpleSearch
de: Einfache Suche

source: Search Router
de: Suche

source: SRS Selector
de: SRS Auswahl

source: Spatial Reference System Selector (SRS Selector)
de: Auswahl der Projektion über eine Auwahlbox (SRS Auswahl)

source: Navigation Toolbar (Zoombar)
de: Navigationstoolbar (Zoombar)

source: WMC List
de: WMC Liste

source: You find detailed information on every element in the `Mapbender element documentation <https://doc.mapbender.org/en/functions.html>`_.
de: Detaillierte Informationen zu jedem Element finden Sie unter `Mapbender element documentation <https://doc.mapbender.org/de/functions.html>`_.

source: Try it yourself
de: Versuchen Sie es selber

source: add a Map Element to the content of your application
de: Fügen Sie ein Kartenelement (Map-Element) zum content-Bereich Ihrer Anwendung hinzu

source: add a Layertree to the content of your application
de: Fügen Sie einen Ebenenbaum (Layertree) zum content-Bereich Ihrer Anwendung hinzu

source: add a button that opens the Layertree to the top of your application
de: Fügen Sie einen Button in die Toolbar hinzu, der den Layertree öffnet

source: add the Navigation Toolbar to the content
de: Fügen Sie das Navigationselement (Navigation Toolbar) in den content-Bereich hinzu

source: add a Copyright and change the copyright text
de: Fügen Sie ein Copyright-Element hinzu und ändern Sie den Copyright-Text.

source: add a SRS Selector to the footer
de: Fügen Sie einen SRS Selector in den Footer-Bereich ein.

source: User and group management
de: Benutzer- und Gruppenverwaltung
