Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/mapserver_quickstart.po
Languages: de

source: MapServer is an `Open Source <http://www.opensource.org>`_ server based application that allows you to publish geographic map images and vector data through the internet using `OGC standards <http://www.opengeospatial.org/standards>`__ such as `WMS <http://www.opengeospatial.org/standards/wms>`__, `WFS <http://www.opengeospatial.org/standards/wfs>`__, and `WCS <http://www.opengeospatial.org/standards/wcs>`__.
de: MapServer ist eine `Open Source <http://www.opensource.org>`_ serverbasierte Anwendung, mit der geografische Kartenbilder und Vektordaten im Internet mittels `OGC Standards <http://www.opengeospatial.org/standards>`_ wie etwa `WMS <http://www.opengeospatial.org/standards/wms>`_ , `WFS <http://www.opengeospatial.org/standards/wfs>`_ und `WCS <http://www.opengeospatial.org/standards/wcs>`__ veröffentlicht werden können.

source: Configure MapServer using the MapFile configuration file
de: MapServer mit einem "mapfile" konfigurieren

source: **What will I learn ?** In this section, you will learn what a MapFile is and how to configure it to allow MapServer to serve a shapefile as images using WMS requests.
de: **Was werden wir lernen ?** In diesem Abschnitt werden Sie lernen, was eine Mapdatei (Mapfile) ist und wie man sie so konfiguriert, dass MapServer eine Shapedatei als Bilder bereitstellt, die mittels einer WMS Anfrage abgerufen werden können.

source: What is a MapFile ?
de: Was ist ein MapFile ?

source: The `Mapfile <http://mapserver.org/mapfile/index.html>`_ is the configuration file that MapServer uses to render geospatial data as images or vector data. Its main purpose is to define the layers it can draw, how to read necessary data, and how to render it (e.g. color, symbol, label, etc...).
de: `Mapfile <http://mapserver.org/mapfile/index.html>`_ ist die Konfigurationsdatei, die MapServer nutzt, um raumbezogene Daten wie Bilder oder Vektordaten bereitzustellen. Der Hauptzweck der Datei ist es, die Layer und deren Datenquelle festzulegen sowie die Darstellung zu definieren (z.B. Farbe, Symbole, Labels, etc. ..).

source: Creating my first MapFile
de: Erstellen einer ersten Mapdatei

source: Open any text editor (e.g. :menuselection:`Applications --> Accessories --> Leafpad`).
de: Öffnen Sie einen Texteditor (e.g. :menuselection:`Applications --> Accessories --> Leafpad`).

source: Create the file "mapserver_quickstart.map" in your home directory: :file:`/home/user/mapserver_quickstart.map`
de: Erstellen Sie eine Datei "mapserver_quickstart.map" in Ihrem Home Verzeichnis: :file:`/home/user/mapserver_quickstart.map`

source: Put the following content in it::
de: Fügen Sie folgenden Text ein::

source: The example uses the natural earth dataset, which is already installed on the live dvd at :file:`~/data/natural_earth2` (a short cut to :file:`/usr/local/share/data/natural_earth2`).
de: Das Beispiel verwendet den Natural Earth Datensatz, der bereits auf auf OSGeoLive vorliegt: :file:`~/data/natural_earth2` (eine Abkürzung für: :file:`/usr/local/share/data/natural_earth2`)

source: Each object in a MapFile starts with its name (for example **MAP**) and ends with an **END**. A MapFile always starts with the **MAP** object and should contain a list of **LAYER** objects the MapFile can read and draw. In our MapFile, we currently have only one layer defined.
de: Jedes Objekt in der Mapdatei beginnt mit seinem Namen (z.B. **MAP**) und endet mit einem **END**. Eine Mapdatei beginnt immer mit dem Objekt **MAP** und sollte eine Liste von **LAYER** Objekten enthalten, die MapServer lesen und zeichnen kann. In unserer Mapdatei haben wir nur einen Layer definiert.

source: Let's take a look at some of the objects (and properties) defined in our MapFile:
de: Lassen Sie uns einen Blick auf einige Objekte (und Eigenschaften) werfen, die in unserer Mapdatei definiert sind:

source: EXTENT: sets the default geospatial bounding box for this configuration.
de: EXTENT : definiert die BoundingBox für diese Konfiguration.

source: LAYER: defines access and display properties for a spatial dataset. We'll add another layer later.
de: LAYER : definiert den Zugriff und die Anzeige-Eigenschaften für einen räumlichen Datensatz. Wir werden weitere Layer später hinzufügen.

source: SHAPEPATH: sets a base path for file-based data (e.g. shapefiles or tiff images).
de: SHAPEPATH : definiert einen Basispfad für Datei-basierte Daten (z.B. Shapedateien oder TIFF-Dateien).

source: If we look closer at the **LAYER** in our MapFile, we'll see that it contains a bunch of properties and objects too. Among them are:
de: Wenn wir genauer auf das Objekt **LAYER** schauen, sehen wir, dass es auch eine Reihe von Objekten und Eigenschaften enthält.

source: STATUS: defines whether the layer can be drawn (*ON*), can't be drawn (*OFF*) or is always drawn (*DEFAULT*).
de: STATUS : ob die Karte gezeichnet (*ON*), nicht gezeichnet (*OFF*) oder immer gezeichet werden soll (*DEFAULT*).

source: TYPE: the geometry type that MapServer should use when rendering the data as an image. In our MapFile, the data will be drawn as *polygons*.
de: TYPE : der Geometrietyp, den der MapServer benutzen soll, wenn die Daten als Bild gezeichnet werden. In unserer Mapdatei werden die Daten als Polygon dargestellt.

source: DATA: the name of the spatial data file this layer uses, in this case a shapefile.
de: DATA : der Name der Datei, in diesem Fall eine Shapedatei.

source: CLASS: determines how to draw a layer (styling). We'll cover this object in more detail later.
de: CLASS : legt fest, wie eine Karte gezeichnet werden soll (styling). Wir gehen darauf später noch genauer ein.

source: A complete list of the available objects and properties a MapFile can have can be found in the `MapServer documentation page <http://mapserver.org/mapfile/index.html>`_.
de: Eine komplette Liste von Objekten und Eigenschaften, die ein `Mapfile <http://mapserver.org/mapfile/index.html>`_ haben kann, finden Sie in der MapServer Dokumentation.

source: Render a map image with MapServer using a WMS **GetMap** request
de: Darstellen einer Karte mit MapServer mittels eines WMS **GetMap** Requests

source: **What will I learn ?** You will learn how to use to render an image with layers from a MapFile with MapServer using an OGC WMS request.
de: **Was werden wir lernen ?** Sie werden lernen, wie mit Hilfe eines OGC WMS Request über MapServer ein Bild von Layern einer Mapdatei angefordert werden kann.

source: Open a web browser and enter the following URL::
de: Öffnen Sie den Webbrowser mit folgender URL::

source: What does the above mean? If we put it in simple words, it's a `Web Map Service (WMS) <http://www.opengeospatial.org/standards/wms>`_ **GetMap** request that tells MapServer to "*use the following MapFile to render the specified layers as a png image based on some user-supplied parameters such as image size, geographical extent, projection, etc.*". All layers specified in the "*&LAYERS=...*" property having *STATUS ON* in the MapFile will be rendered in addition to all layers with *STATUS DEFAULT*. The result looks like the following:
de: Was bedeutet der Aufruf? Einfach gesagt, es ist ein `Web Map Service (WMS) <http://www.opengeospatial.org/standards/wms>`_ **GetMap** Request, der MapServer sagt, er soll die angegebene Mapdatei verwenden, um bestimmte Layer als PNG Bild mit festgelegten Eigenschaften wie Bildgröße, Ausdehnung, Projektion, etc.* darzustellen. Alle Layer im "*&LAYERS=...*" Bereich, die *STATUS ON* oder *STATUS DEFAULT* in der Mapdatei haben, werden nun dargestellt. Das Ergebnis sieht wie folgt aus:

source: All parameters of the request are WMS-specific, except "*?map=/home/user/mapserver_quickstart.map*", which is MapServer-specific.
de: Alle Parameter des Requests sind WMS-spezifisch, außer "*?map=/home/user/mapserver_quickstart.map*", welcher MapServer-spezifisch ist.

source: Render a map image with MapServer using the command line
de: Erzeugen eines Kartenbildes über die Kommandozeile

source: Although MapServer is geared towards web applications, it can also produce images on the command line. This can be useful if you are looking for repetitive mapping, or while debugging.
de: Obwohl MapServer für den Einsatz in Webanwendungen ausgerichtet ist, können Bilder auch über die Kommandozeile erzeugt werden. Dies kann beispielsweise bei sich wiederholenden Kartendarstellungen oder beim Debuggen hilfreich sein.

source: Open a terminal (:menuselection:`Applications --> Accessories --> Terminal Emulator`) and type::
de: Öffnen Sie ein Terminal (:menuselection:`Applications --> Accessories --> Terminal Emulator`) und tippen Sie:

source: If this command runs successfully, you are able to see your rendered map at file:///home/user/mymap.png.
de: Wenn dieser Aufruf erfolgreich ausgeführt wird, finden Sie unter file:///home/user/mymap.png ein generiertes Kartenbild.

source: Add a new layer to the MapFile to serve a local shapefile
de: Einen neuen Layer im "mapfile" ergänzen, um eine Shapedatei darzustellen

source: **What will I learn ?** You will learn how to add a new layer object definition to your MapFile.
de: **Was werden wir lernen ?** Sie werden lernen, wie man neue Layer-Objekte in einer Mapdatei definiert.

source: We will now add a new layer to our MapFile. Before the last *END* statement in the MapFile, add the following layer configuration::
de: Wir ergänzen jetzt einen weiteren Layer zu unserer Mapdatei. Vor dem letzten *END* in der Datei, fügen wir folgende Layer-Konfiguration hinzu::

source: Now we have 2 layer definitions in our MapFile. Note that the new one we just added has the "STATUS" property set to "ON". That means that unless we specifically request it, it won't be rendered.
de: Nun haben wir 2 Layer-Definitionen in unserer Mapdatei. Der neue Layer hat die "STATUS ON" Eigenschaft. Das heisst, solange wir ihn nicht explizit anfragen, wird er nicht dargestellt.

source: Let's take our previous WMS **GetMap** request and add our new "Lakes" layer to the image rendered. We simply need to add the new layer name to the "LAYERS" property list::
de: Nehmen wir nun unseren vorherigen WMS **GetMap** Request und ergänzen den neuen Layer "Lakes" zu dem erzeugten Bild. Dazu müssen wir einfach nur den neuen layer Namen zur "LAYERS"-Liste hinzufügen::

source: The image rendered by MapServer looks like our previous map, but with the addition of the lakes from our new layer:
de: Das Bild, das nun vom MapServer dargestellt wird sieht aus wie das vorherige, nur mit dem zusätzlichen neuen lake-Layer:

source: Style a layer using MapFile configurations
de: Darstellung eines Layers anpassen mit "mapfile" Konfigurationen

source: **What will I learn ?** You will see an example of styling elements inside a layer depending on some of its data properties.
de: **Was werden wir lernen ?** Sie sehen ein Beispiel für die Darstellungselemente eines Layers in Abhängigkeit von seinen Eigenschaften.

source: In a MapFile, a LAYER object can contain an infinite number of CLASS objects. These are used to style the elements contained in the spatial data file (DATA). For example, if we look closer at our "ne_10m_lakes" data file using a tool such as `ogrinfo <http://www.gdal.org/ogrinfo.html>`_, we'll see the geometry and attribute definitions it contains. These attribute values can be used as a way to draw the elements inside a dataset differently using multiple CLASS objects.
de: In einer Mapdatei kann ein Layer-Objekt eine unendliche Anzahl von CLASS-Objekten enthalten. Diese werden verwendet, um die Darstellung von Elementen eines Layers (DATA) zu definieren. Zum Beispiel, wenn wir uns die "10m_lakes" Datei mit einem Tool wie `ogrinfo <http://www.gdal.org/ogrinfo.html>` anzeigen lassen _, sehen wir die Geometrie und Attribut-Definitionen der Objekte. Diese Attributwerte können verwendet werden, um die Objekte innerhalb eines Datensatzes mit mehreren unterschiedlichen CLASS-Objekten unterschiedlich darzustellen.

source: In our "ne_10m_lakes" dataset, we have a *ScaleRank* attribute, which seems to be related ot the size of the lakes. We can use this as a way to render the lakes differently. In the LAYER object, we'll add another CLASS object just before our current one::
de: Im "10m_lakes" Datensatz haben wir das *ScaleRank* Attribut, welches in Bezug zur Größe der Seen steht. Wir können es benutzen, um die Seen unterschiedlich darzustellen. Im LAYER-Objekt fügen wir ein weiteres CLASS-Objekt hinzu::

source: What does our new CLASS object do? It basically tells MapServer to draw the elements having the "ScaleRank" property equal to "0" or "1" with a black outline. Class objects are always read from the top to the bottom for each feature to be drawn. When a feature matches the "EXPRESSION" specified in a class, that class is going to render the feature. If the feature does not match a class the next class is checked. If a feature does not match any class then it is not rendered at all but if the last class in a layer contains no EXPRESSION then that class acts as a default. The LAYER "CLASSITEM" property tells MapServer which attribute to use when evaluating EXPRESSIONs defined in the CLASS objects.
de: Was macht dieses neue CLASS-Objekt? Die Klasse definiert, dass das Elemente mit der "ScaleRank"-Eigenschaft gleich "0" oder "1" mit einem schwarzen Umriss gezeichnet werden sollen. CLASS-Objekte werden immer von oben nach unten für jedes Objekt gelesen. Wenn ein Objekt mit der "EXPRESSION" mit einer Klasse übereinstimmt, wird diese Klasse verwendet, um das Objekt darzustellen. Wenn das Objekt nicht mit einer Klasse übereinstimmt, wird es anhand der nächsten Klasse überprüft. Wenn ein Objekt mit keiner Klasse übereinstimmt und die letzte Klasse in einem LAYER-Objekt keine "EXPRESSION" enthält, dann wird diese Klasse als Standard benutzt. Das LAYER-Objekt "CLASSITEM" teilt MapServer mit, welches Attribut bei der Auswertung von EXPRESSIONs benutzt werden soll.

source: The result of this new addition should make the big lakes in our map image rendered with a black outline:
de: Das Ergebnis dieser Ergänzung bewirkt, dass große Seen mit einem schwarzen Umriss gezeichnet werden:

source: Learn more about `EXPRESSIONS <http://mapserver.org/mapfile/expressions.html>`_ in MapServer.
de: Lernen Sie mehr über `EXPRESSIONS <http://mapserver.org/mapfile/expressions.html>`_ im MapServer.

source: What Next?
de: Was kommt als Nächstes?

source: This is a simple example, but you can do much, much more. The MapServer project website contains many resources to help you get started. Here's a few resources to check out next:
de: Dies ist ein einfaches Beispiel und Sie können noch viel, viel mehr machen. Die MapServer Projekt Webseite enthält zahlreiche Hilfen, um Ihnen einen einfachen Einstieg zu ermöglichen. Hier sind ein paar Tipps, wo sie als nächstes nachschauen können:

source: Read the `Introduction to MapServer <http://mapserver.org/introduction.html#introduction>`_.
de: Lesen Sie die `Introduction to MapServer <http://mapserver.org/introduction.html#introduction>`_.

source: Have a look at the `MapServer Tutorial <http://www.mapserver.org/tutorial/index.html>`_ which contains more MapFile examples.
de: Schauen Sie sich das `MapServer Tutorial <http://www.mapserver.org/tutorial/index.html>`_ an, es enthält weitere Mapdatei Beispiele.

source: Check the `OGC Support and Configuration <http://www.mapserver.org/ogc/index.html>`_ to learn more about OGC standards in MapServer (WMS, WFS, SLD, WFS Filter Encoding, WCS, SOS, etc.).
de: Lesen Sie über `OGC Support and Configuration <http://www.mapserver.org/ogc/index.html>`_ um mehr über OGC Standards im MapServer (WMS, WFS, SLD, WFS Filter Encoding, WCS, SOS, etc.) zu lernen.

source: Ready to use MapServer? Then join the community on the `Mailing Lists <http://www.mapserver.org/community/lists.html>`_ to exchange ideas, discuss potential software improvements and ask questions.
de: Bereit, mit dem MapServer zu arbeiten ? Dann tragen Sie sich in die `Mailing Listen <http://www.mapserver.org/community/lists.html>`_ der Community ein, um Ideen auszutauschen, Verbesserungen zu diskutieren und Fragen zu stellen.
