Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/quickstart/ossim_quickstart.po
Languages: es

source: OSSIM Quickstart
es: Guía de Inicio Rápido de OSSIM

source: Open Source Software Image Map (OSSIM) is a high performance engine for remote sensing, image processing, geographical information system (GIS) tasks and photogrammetry.
es: Open Source Software Image Map (OSSIM) es un motor de alto rendimiento para la detección remota, procesamiento de imágenes, tareas de sistema de información geográfica (SIG) y fotogrametría.

source: This Quick Start describes how to:
es: Esta Guía de Inicio Rápido describe cómo:

source: Multi-view multiband raster satellite images with Imagelinker
es: Vista múltiple de imágenes ráster multibanda de satélite con Imagelinker

source: Drape a georeferenced raster map on a 3D globe with ossimPlanet
es: Cubra un mapa ráster georreferenciado en un globo 3D con ossimPlanet

source: Start Imagelinker from its icon from the "Spatial Tools" folder on the desktop
es: Inicie Imagelinker desde el icono de la carpeta "Herramientas espaciales" en el escritorio

source: Open an image file, using :menuselection:`File --> Open Image --> /home/user/data/landsat/clip10.tif`
es: Abra un archivo de imagen usando :menuselection:`File --> Open Image --> /home/user/data/landsat/clip10.tif`

source: Repeat the previous operation for the files : `clip20.tif` and `clip30.tif`
es: Repetir la operación anterior para los archivos : `clip20.tif` and `clip30.tif`

source: Another way to load all the images at once is to simply drag and drop them into the Imagelinker main window
es: Otra forma para cargar todas las imágenes a la vez es simplemente arrastrar y soltar en la ventana principal de Imagelinker

source: To tidy up the windows, maximize the main window, then in the top menu bar go to :menuselection:`Window --> Tile`
es: Para poner en orden las ventanas, maximizar la ventana principal y, a continuación, en la barra de menú superior ir a :menuselection:`Window --> Tile`

source: You can keep all the satellite band views in sync by clicking :guilabel:`Fit` in one of the smaller windows, then :guilabel:`Propagate` in that same window. Try doing the same in the larger window.
es: Puede mantener todas las vistas de la banda satelital en sincronización haciendo click en :guilabel:`Fit` en una de las ventanas más pequeñas, después en :guilabel:`Propagate` en esa misma ventana. Trate de hacer lo mismo en la ventana grande.

source: Again in the large image window make sure the zoom button (magnifying glass) is depressed and click in middle of the big road intersection. With the closer view in the window, again click the :guilabel:`Propagate` button in the large image window to sync that view with the other band windows. In a similar way you can press the pan button (hand icon) and then click to move along the road, and then the :guilabel:`Propagate` button to align the other windows.
es: Otra vez en la ventana de imagen grande asegúrese de que está pulsado el botón de zoom (lupa) y haga click en medio de la intersección del camino grande. Con la vista más cercana de la ventana, nuevamente haga click en el botón :guilabel:`Propagate` en la ventana de la imagen grande para sincronizar esa vista con otras ventanas de banda. De manera similar puede presione el botón de arrastre (icono de mano) y luego hacer click en para mover a lo largo de la carretera, y luego en el botón :guilabel:`Propagate` para alinear las demás ventanas.

source: Launch OssimPlanet from its icon in the "Desktop GIS" folder on the desktop
es: Iniciar OssimPlanet desde su ícono en la carpeta "Desktop GIS" en el escritorio

source: Select :menuselection:`File --> Open Image --> /home/user/data/landsat/clip10.tif` to load a LANDSAT image (or simply drag and drop the image into the main window).
es: Seleccione :menuselection:`File --> Open Image --> /home/user/data/landsat/clip10.tif` para cargar una imagen LANDSAT (o simplemente arrastre y suelte la imagen en la ventana principal).

source: In the `Layer` tree panel on the left side, click on the small triangle to the left of *Image Layers* to expand it. Next double-click on ``clip10``. You should now see the scene zoom to the image's location.
es: En el panel de árbol de 'Capa' en el lado izquierdo, haga click en el pequeño triángulo a la izquierda de *Capas de la Imagen* para expandirlo. A continuación haga doble click en ``clip10``. Ahora debe ver la escena zoom a ubicación de la imagen.

source: To turn off the daylight auto-shading, `un`-check :menuselection:`File --> Preferences --> Environment --> Enable Ephemeris`
es: Para apagar la luz del día auto-shading, `un`-check :menuselection:`File --> Preferences --> Environment --> Enable Ephemeris`

source: Experiment with navigating the scene using the mouse. Dragging the left mouse button pans; dragging the middle mouse button rolls; and dragging the right mouse button zooms in and out.
es: Experimento con navegar por la escena con el ratón. Arrastrando las teclas del botón izquierdo del mouse; arrastrando la rueda central del mouse; y arrastrando el botón derecho del mouse puede hacer acercamientos y alejamientos.

source: If you get lost, double clicking on the Blue Marble image in the Layer tree will zoom back out to a view of the whole planet, resetting the view.
es: Si se pierde, haga doble click en la imagen de Blue Marble en el Árbol de Capas y se alejará nuevamente a la vista de todo el planeta, restableciendo la vista.

source: What Next?
es: ¿Qué sigue?

source: We have prepared a number of tutorials_ demonstrating more of Ossim's capabilities.
es: Hemos preparado una serie de tutorials_ demostraciones de más capacidades de Ossim.

source: See also the included documentation_ on this Live DVD.
es: Véase también la documentation_ incluida en este Live DVD.
