Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/eoxserver_overview.po
Languages: de, fr, hu

source: About
de: Über
fr: A propos
hu: Névjegy

source: EOxServer is a server for presenting big Earth Observation (EO) data archives and metadata via Open Standards.
de: EOxServer ist ein Server, mit dem große Archive von Erdbeobachtungsdaten (Earth Observation - EO) über offene Standards zur Verfügung gestellt werden können.
fr: EOxServer est un serveur pour présenter des archives de données Earth Observation (EO) de grande taille et des métadonnées via des standards ouverts
hu: Az EOxServer egy kiszolgáló nagy földi megfigyelési (EO) adatarchívumok és metaadatok megjelenítésére nyílt szabványokon keresztül.

source: Earth Observation data currently supported includes 2D raster data generally acquired using sensors on satellites or aircrafts and including information about the time of acquisition and the footprint on planet Earth. It is typically used to monitor Earth's natural and built environment.
de: Die momentan unterstützen Erdbeobachtungsdaten beinhalten 2D Rasterdaten wie sie im Allgemeinen von Sensoren auf Satelliten oder Flugzeugen aufgenommen werden und welche Informationen zu Zeit und Ort (Fußabdruck auf der Erde) der Aufnahme enthalten. Diese Daten werden üblicherweise benutzt, um die natürliche und die bebaute Umwelt auf der Erde zu beobachten.
fr: La donnée Earth Observation supportée actuellement inclut de la donnée raster 2D généralement acquise en utilisant des capteurs sur des satellites ou des avions et incluant des informations sur l'heure d'acquisition et l'empreinte sur la planète Terre. Elle est typiquement utilisée pour surveiller l'environnement naturel et construit de la Terre.
hu: A jelenleg támogatott Föld-megfigyelési adatok a 2D-s raszter adatokat foglalják magukba, amelyeket általában műholdakra vagy repülőgépekre telepített szenzorokkal gyűjtenek, és tartalmazza a felvétel idejéről és a kiterjedéséről szóló információkat. Ezt általában a Föld természetes és épített környezetének megfigyelésére használják.

source: EOxServer builds upon an Open Source stack of software which includes Python, :doc:`MapServer <mapserver_overview>`, Django/GeoDjango, :doc:`GDAL <gdal_overview>`, PROJ.4, and a :doc:`SpatiaLite <spatialite_overview>` or :doc:`PostGIS <postgis_overview>` database.
de: EOxServer basiert komplett auf Open Source Software wie Python, :doc:`MapServer<mapserver_overview>`, Django/GeoDjango, :doc:`GDAL <gdal_overview>`, PROJ.4, und einer :doc:`SpatiaLite <spatialite_overview>` oder :doc:`PostGIS <postgis_overview>` Datenbank.
fr: EOxServer est construit sur une pile de logiciels Open Source qui inclue Python, :doc:`MapServer <mapserver_overview>`, Django/GeoDjango, :doc:`GDAL <gdal_overview>`, PROJ.4, et les bases de données :doc:`SpatiaLite <spatialite_overview>` ou :doc:`PostGIS <postgis_overview>` .
hu: At EOxServer nyílt forráskódú szoftverekre épül, mely tartalmazza a Python, :doc:`MapServer <mapserver_overview>`, Django/GeoDjango, :doc:`GDAL <gdal_overview>`, PROJ.4 és :doc:`SpatiaLite <spatialite_overview>` vagy :doc:`PostGIS <postgis_overview>` adatbázis. összetevőket.

source: Core Features
de: Kernfunktionen
fr: Caractéristiques principales
hu: Alapfunkciók

source: View, filter, subset, and download EO data
de: Anzeige, Filterung, Auswahl und Downlaod von Erdbeobachtungsdaten
fr: Visualiser, filtrer, échantillonner et télécharger de la donnée EO
hu: EO adatok megjelenítése, szűrése, részhalmaz képzése és letöltése

source: Register EO data archives
de: Registrieren von EO Archiven
fr: Enregistrement des archives de données EO
hu: EO adat archívumok regisztrálása

source: Web based and command line administration interface
de: Administration via Web und Kommandozeile
fr: Interface d'administration web et en ligne de commande
hu: Web alapú és parancssori adminisztrációs felület

source: Publish data via `Open Geospatial Consortium (OGC) standards <http://www.opengeospatial.org/standards>`__:
de: Zur Verfügung stellen von Daten über `Open Geospatial Consortium (OGC) standards <http://www.opengeospatial.org/standards>`__:
fr: Publier la donnée via `les standards de l'Open Geospatial Consortium (OGC) <http://www.opengeospatial.org/standards>`__:
hu: Adatok publikálása `Open Geospatial Consortium (OGC) szabványokon <http://www.opengeospatial.org/standards>`__ keresztül:

source: `Web Coverage Service (WCS) <http://www.opengeospatial.org/standards/wcs>`__ 1.0, 1.1 and 2.0 & proposed EO-WCS
de: `Web Coverage Service (WCS) <http://www.opengeospatial.org/standards/wcs>`__ 1.0, 1.1 und 2.0 & vorgeschlagenes EO-WCS
fr: `Web Coverage Service (WCS) <http://www.opengeospatial.org/standards/wcs>`__ 1.0, 1.1 et 2.0 & EO-WCS proposé
hu: `Web Coverage Service (WCS) <http://www.opengeospatial.org/standards/wcs>`__ 1.0, 1.1 és 2.0 & javasolt EO-WCS

source: Proposed extensions to WCS including: GeoTIFF encoding, predefined projections (CRSs), scaling, and interpolation.
de: Vorgeschlagene Erweiterungen für WCS wie: GeoTIFF-Codierung, vordefinierte Projektionen (CRSs), Skalierung und Interpolation.
fr: Extensions proposées au WCS incluant: encodage GeoTIFF, projections prédéfinies (CRSs), mise à l'échelle et interpolation.
hu: WCS-hez javasolt bővítmények: GeoTIFF encoding, vetületek (CRSs), méretezés, és interpoláció.

source: Protocols supported are: KVP and XML/POST (used together with SOAP2POST Proxy to provide also XML/SOAP)
de: Die unterstützen Protokolle sind: KVP und XML/POST (zusammen verwendet mit dem SOAP2POST Proxy auch XML/SOAP)
fr: Les protocoles supportés sont: KVP et XML/POST (utilisés ensemble avec le proxy SOAP2POSTpour fournir aussi XML/SOAP)
hu: Támogatott protokollok: KVP és XML/POST (a SOAP2POST Proxy-val együtt használva XML/SOAP biztosítása is)

source: Publish using the following formats and groupings:
de: Veröffentlichung der folgenden Formate und Gruppierungen:
fr: Publier en utilisant les formats et regroupements suivants:
hu: Publikálás a következő formátumok és csoportok felhasználásával:

source: 2-D EO Coverages derived from gmlcov:RectifiedGridCoverage
de: 2-D EO Coverages abgeleitet von gmlcov:RectifiedGridCoverage
fr: Couvertures 2-D EO dérivées de gmlcov:RectifiedGridCoverage
hu: gmlcov:RectifiedGridCoverage-ből levezetett 2-D EO fedvények

source: 2-D EO Coverages derived from gmlcov:ReferenceableGridCoverage
de: 2-D EO Coverages abgeleitet von gmlcov:ReferenceableGridCoverage
fr: Couvertures 2-D EO dérivées de gmlcov:ReferenceableGridCoverage
hu: gmlcov:ReferenceableGridCoverage-ből levezetett 2-D EO fedvények

source: Dataset Series as a collection of EO Coverages e.g. in a time series
de: Dataset Series (Daten-Serien) als eine Sammlung von EO Coverages, zum Beispiel einer Zeitreihe
fr: Séries de jeux de données comme collection de couvertures EO c'est à dire dans des séries temporelles
hu: Adatsorok mint EO fedvények sorozata pl. idősorok

source: Stitched Mosaics of Rectified EO Coverages including contributingFootprint
de: Stitched Mosaics (Zusammengefügte Mosaike) von Rectified EO Coverages einschließlich des Konzeptes von contributingFootprint
fr: Mosaïques regroupées de couvertures EO rectifiées incluant contributingFootprint
hu: Helyesbített EO fedvények illesztett mozaikjai beleértve a contributingFootprint-et

source: Coverage formats supported:
de: Unterstützte Coverage-Formate:
fr: Formats de couverture supportés:
hu: Támogatott feddvény formátumok:

source: Formats supported by the GDAL library
de: Durch die GDAL-Bibliothek unterstützte Datenformate
fr: Formats supportés par la bibliothèque GDAL
hu: GDAL könyvtár általtámogatott formátumok

source: Implemented Standards
de: Implementierte Standards
fr: Standards implémentés
hu: Implementált szabványok

source: Details
fr: Détails
hu: Részletek

source: **Website:** https://eoxserver.readthedocs.org/
de: **Webseite:** https://eoxserver.readthedocs.org/
fr: **Site web:** https://eoxserver.readthedocs.org/
hu: **Honlap:** https://eoxserver.readthedocs.org/

source: **Licence:** `MIT-style license <https://eoxserver.readthedocs.org/en/latest/copyright.html#license>`_
de: **Lizenz:** `MIT-style license <https://eoxserver.readthedocs.org/en/latest/copyright.html#license>`_
fr: **Licence:** `licence MIT-style <https://eoxserver.readthedocs.org/en/latest/copyright.html#license>`_
hu: **Licenc:** `MIT-style license <https://eoxserver.readthedocs.org/en/latest/copyright.html#license>`_

source: **Software Version:** |version-eoxserver|
fr: **Version du logiciel:** |version-eoxserver|
hu: **Szoftver verzió:** |version-eoxserver|

source: **Supported Platforms:** Linux, Windows, Mac
de: **Unterstützte Plattformen:** Linux, Windows, Mac
fr: **Plates-formes supportées:** Linux, Windows, Mac
hu: **Támogatott platformok:** Linux, Windows, Mac

source: **API Interfaces:** Python
de: **API Schnittstellen:** Python
fr: **Interface d'API:** Python
hu: **API interfészek:** Python

source: **Support:** https://eoxserver.readthedocs.org/en/latest/users/basics.html#where-can-i-get-support
hu: **Támogatás:** https://eoxserver.readthedocs.org/en/latest/users/basics.html#where-can-i-get-support

source: Quickstart
de: Schnellstart
fr: Guide de démarrage rapide
hu: Gyorstalpaló

source: :doc:`Quickstart documentation <../quickstart/eoxserver_quickstart>`
de: :doc:`Quickstart Dokumentation <../quickstart/eoxserver_quickstart>`
fr: :doc:`Documentation du guide de démarrage rapide <../quickstart/eoxserver_quickstart>`
hu: :doc:`Gyorstalpaló dokumentáció <../quickstart/eoxserver_quickstart>`
