Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/geonode_overview.po
Languages: de, fr, hu

source: Geospatial Content Management System
fr: Système de Gestion de Contenus Géospatial
hu: Térinformatikai tartalomkezelő rendszer

source: `GeoNode <http://geonode.org>`_ is a Content Management System for geospatial data which provides creation, sharing, and collaborative use of geospatial data. Datasets can be uploaded in various formats, maps can be edited, styled and aggregated through browser based tools, maps and metadata can be published and searched, and reviews, ratings and comments can be captured from users.
de: `GeoNode <http://geonode.org>`_ ist ein Content Management System für räumliche Daten, das die Erzeugung, Verteilung und die gemeinsame Nutzung von räumlichen Daten ermöglicht. Datensätze können in verschiedenen Formaten hochgeladen werden, Karten können über einen browserbasiertes Werkzeug editiert, der Stil kann angepasst werden und Themen können zusammengestellt werden. Karten und Metadaten können veröffentlicht und durchsucht werden. Prüfungen, Bewertungen und Kommentare können von Anwendern abgegeben werden.
fr: `GeoNode <http://geonode.org>`_ est un Système de Gestion de Contenus pour les données géospatiales qui propose la création, le partage et l'utilisation collaborative de données géospatiales. Les jeux de données peuvent être téléchargés dans des formats variés, les cartes peuvent être modifiées, stylisées et agrégées via des outils basés dans le navigateur; les cartes et méta-données peuvent être publiées et recherchées, et les revues, notations et commentaires peuvent être récupérés des utilisateurs.
hu: `GeoNode <http://geonode.org>`_ egy tartalomkezelő rendszer térinformatikai adatokhoz, mely a térinformatikai adatok létrehozását, megosztását és közös használatát biztosítja. Az adatok különböző formátumokban tölthetők fel, a térképek szerkeszthetők. stílusuk módosítható, és összevonhatók böngésző alapú eszközökkel, a térképek és a meta adatok publikálhatók, kereshetők, értékelések és megjegyzések gyűjthetők a felhasználóktól.

source: GeoNode is built upon: GeoServer, GeoExplorer, pycsw, Django, and GeoExt.
de: GeoNode baut auf folgender Soaftware auf: GeoServer, GeoExplorer, pycsw, Django und GeoExt.
fr: GeoNode est construit sur : GeoServer, GeoExplorer, pycsw, Django et GeoExt.
hu: A GeoNode a következő programokon alapul: GeoServer, GeoExplorer, pycsw, Django és GeoExt.

source: Core Features
de: Kernfunktionen
fr: Caractéristiques principales
hu: Alapfunkciók

source: Spatial Data Discovery
de: Räumliche Daten entdecken
fr: Découverte de données spatiales
hu: Térbeli adatok felfedezése

source: Powerful spatial search engine
de: Leistungsstarke räumliche Suche
fr: Moteur de recherche spatial puissant
hu: Hatékony térbeli kereső motor

source: Federated OGC services
de: OGC Dienste
fr: Services fédérés OGC
hu: Egyesített OGC szolgáltatások

source: Metadata catalogue
de: Metadatakatalog
fr: Catalogue de métadonnées
hu: Meta adat katalógus

source: Import and Manage Geospatial Data
de: Import und Management von räumlichen Daten
fr: Importer et gérer les données géospatiales
hu: Téradatok importja és kezelése

source: Publish raster, vector, and tabular data
de: Veröffentlichung von Raster-, Vektor- und tabellarischen Daten
fr: Publier les données raster, vecteur et tabulaires
hu: Raszter, vektor és táblázatos adatok publikálása

source: Manage metadata and associated documents
de: Management von Metadaten und angefügten Dokumenten
fr: Gérer les méta-données et documents associés
hu: Meta adatok és kapcsolódó dokumentációk kezelése

source: Securely or publicly share data
de: Abgesicherte oder öffentliche Nutzung von Daten
fr: Partager les données en sécurité et en public
hu: Biztonságosan vagy nyilvánosan megosztott adatok

source: Versioned geospatial data editor
de: Versionierter Editor
fr: Éditeur de données géospatiales versionnées
hu: Verzió követő téradat szerkesztés

source: Interactive Mapping
de: Interaktives Mapping
fr: Cartographie interactive
hu: Interaktív térképezés

source: GeoExplorer GIS client
fr: Client GeoExplorer SIG
hu: GeoExplorer GIS kliens

source: Graphical style editor
de: Grafischer Stil-Editor
fr: Éditeur de style graphique
hu: Grafikus stílus szerkesztő

source: Create multi-layer interactive maps
de: Erzeugung von interaktive Karten mit vielen Ebenen
fr: Créer des cartes interactives multi-couches
hu: Több réteges interaktív térképek létrehozása

source: Share and embed maps in web pages
de: Weitergabe und Einbindung von Karten in Webseiten
fr: Partager et incorporer des cartes dans des pages web
hu: Térképek megosztása és beágyazása web lapokon

source: Print maps as PDF
de: Druckausgabe als PDF
fr: Imprimer des cartes en tant que PDF
hu: Térkép nyomtatás PDF-ben

source: Collaboration
de: Zusammenarbeit
hu: Együttműködés

source: Review, rate, and comment on data
de: Prüfung, Bewertung, und Kommentare auf Daten
fr: Revue, notation et commentaire sur les données
hu: Tekintse át, értékelje és fűzzön megjegyzést az adatokhoz

source: Groups of users
de: Gruppen von Benutzern
fr: Groupes d'utilisateurs
hu: Felhasználói csoportok

source: Activity streams
de: Aktivitätsanzeige
fr: Flux d'activité
hu: Tevékenységek

source: Announcements and notifications
de: Ankündigungen und Benachrichtigungen
fr: Annonces et notifications
hu: Bejelentések és figyelmeztetések

source: ... and more!
de: ... und mehr!
fr: ... et plus!
hu: és még továbbiak!

source: Implemented Standards
de: Unterstützte Standards
fr: Standards implémentés
hu: Implementált szabványok

source: Details
fr: Détails
hu: Részletek

source: **Website:** http://geonode.org/
de: **Webseite:** http://geonode.org/
fr: **Site web :** http://geonode.org/
hu: **Honlap:** http://geonode.org/

source: **Licence:** GNU General Public License (GPL) version 2.0
de: **Lizenz:** GNU General Public License (GPL) Version 2.0
hu: **Licenc:** GNU General Public License (GPL) version 2.0

source: **Software Version:** |version-geonode|
fr: **Version du logiciel :** |version-geonode|
hu: **Szoftver verzió:** |version-geonode|

source: **Supported Platforms:** Windows, Linux, Mac
de: **Unterstützte Plattformen:** Windows, Linux, Mac
fr: **Plates-formes supportées :** Windows, Linux, Mac
hu: **Támogatott platformok:** Windows, Linux, Mac

source: **API Interfaces:** Python (Django)
de: **API Schnittstellen:** Python (Django)
fr: **Interfaces API :** Python (Django)
hu: **API interfészek:** Python (Django)

source: **Support:** http://opengeo.org/technology/geonode/
hu: **Támogatás:** http://opengeo.org/technology/geonode/

source: Quickstart
de: Schnellstart
fr: Guide de démarrage rapide
hu: Gyorstalpaló

source: :doc:`Quickstart documentation <../quickstart/geonode_quickstart>`
de: :doc:`Quickstart Dokumentation <../quickstart/geonode_quickstart>`
fr: :doc:`Guide de démarrage rapide <../quickstart/geonode_quickstart>`
hu: :doc:`Gyorstalpaló dokumentáció <../quickstart/geonode_quickstart>`
