Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/istsos_overview.po
Languages: de

source: Data Management Tool
de: Daten-Managementwerkzeug

source: istSOS is sensor data management tool that allows collection, maintenance and publishing of monitoring observations using the Open Geospatial Consortium (OGC) `Sensor Observation Service (SOS) <http://www.opengeospatial.org/standards/sos>`__ standard.
de: istSOS ist ein Managementwerkzeug für Sensordaten, das das Sammeln, Pflegen und Monitoren von Beobachtungen mit Hilfe der Standards des Open Geospatial Consortium (OGC)`Sensor Observation Service (SOS) <http://www.opengeospatial.org/standards/sos>` ermöglicht.

source: istSOS strictly implements the SOS 1.0.0 standard, and has passed the OGC CITE (Compliance + Interopability Testing + Evaluation) units tests.
de: istSOS folgt streng dem SOS 1.0.0 Standard und hat die OGC CITE (Compliance + Interopability Testing + Evaluation) Units Tests bestanden.

source: Core Features
de: Kernfunktionen

source: Publish sensor data in accordance with the Sensor Observation Service (SOS) standard.
de: Veröffentlichen von Sensordaten gemäß des Sensor Observation Service (SOS) Standards.

source: Administer sensors and data with an intuitive web-based interface.
de: Administration von Sensordaten und anderen Daten mit der intuitiven webbasierten Oberfläche.

source: Use a complete RestFul API to access istSOS functionality from external clients to create interactive charts, display sensor on a dinamic map or just write some maintainance scripts.
de: Verwendung einer kompletten Restful API für den Zugriff auf istSOS Funktionalität von externen Clients zur Erzeugung von interaktiven Diagrammen, zur Anzeige von Sensordaten auf einer dynamischen Karte oder lediglich zum einfachen Schreiben von Wartungsskripten.

source: Get notified through mail, twitter or other social media when sensor data meets specific conditions.
de: Benachrichtigung per Mail, twitter oder über andere soziale Medien, wenn Sensordaten bestimmte Bedingungen erfüllen.

source: User authentication and authorization with different access levels (administrator, network manager, data manager and visitor).
de: Benutzerauthentifikation und Authorisierung mit unterschiedlichen Zugriffsstufen (Administrator, Netzwerkmanager, Datenmanager und Besucher).

source: Create Virtual Procedures that looks like normal stations but whose data results from on-the-fly elaboration of other sensor data.
de: Erzeugung von Virtuellen Prozeduren, die wie normale Stationen aussehen, deren Daten aber aus on-the-fly Darstellungen von anderen Sensordaten resultieren.

source: Associate quality indexes to each observation thanks to embedded validation tests.
de: Verbinden von Qualitätsindices für jede Beobachtung durch eingebaute Plausibilitätsprüfungen.

source: Online editing of data with a seamless interface and advanced observation calculator.
de: Onlineerfassung von Daten mit einer übergangslosen Oberfläche und erweitertem Beobachtungsrechner.

source: Implemented Standards
de: Implementierte Standards

source: SOS 1.0.0: Basic and Transactional profiles
de: SOS 1.0.0: Basis und Transaktionale Profile

source: **Licence:** GNU General Public License (GPL) version 2
de: **Lizenz:** GNU General Public License (GPL) version 2

source: **Supported Platforms:** Linux, Unix, Mac, Windows
de: **Unterstützte Plattformen:** Linux, Unix, Mac, Windows

source: **API Interfaces:** Python / wsgi
de: **API Schnittstellen:** Python / wsgi

source: :doc:`Quickstart documentation <../quickstart/istsos_quickstart>`
de: :doc:`Quickstart Dokumentation <../quickstart/istsos_quickstart>`
