Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/mapserver_overview.po
Languages: de, fr, hu

source: Web Service
fr: Service Web
hu: Web szolgáltatás

source: MapServer is an `Open Source <http://www.opensource.org>`_ geographic data rendering engine written in C. Beyond browsing GIS data, MapServer allows you create "geographic image maps", that is, maps that can direct users to web content. For example, the Minnesota DNR `Recreation Compass <http://www.dnr.state.mn.us/maps/compass.html>`_ provides users with more than 10,000 web pages, reports and maps via a single application. The same application serves as a "map engine" for other portions of the site, providing spatial context where needed.
de: MapServer ist eine `Open Source <http://www.opensource.org>`_ Software zur Visualisierung von räumlichen Daten, die in der Sprache C geschrieben wurde. Neben der Anzeige von Geodaten können MapServer Anwendungen den Nutzer über die Karte zu thematischen Inhalten weiterleiten. Beispielsweise stellt der Minnesota DNR `Recreation Compass <http://www.dnr.state.mn.us/maps/compass.html>`_ seinen Nutzern mehr als 10000 Webseiten, Berichte und Karten über eine einzige Anwendung zur Verfügung. Die Anwendung dient als Kartenkomponente und verlinkt auf andere Bereiche der Seite. Sie stellt je nach Thema einen räumlichen Kontext her.
fr: MapServer est un moteur de rendu de données cartographiques `Opensource <http://www.opensource.org>`_ écrit en C. Au delà de la possibilité d'explorer des données SIG, MapServer vous permet de créer des images de cartes géographiques, qui sont des cartes permettant de diriger des utilisateurs vers du contenu web. Par exemple, `le compas pour les loisirs <http://www.dnr.state.mn.us/maps/compass.html>`_ du département des ressources naturelles du Minnesota fournit aux utilisateurs plus de 10 000 pages web, rapports et cartes via une seule application. La même application sert aussi de "moteur de carte" pour d'autres parties du site, fournissant un contexte spatial là où c'est nécessaire.
hu: A MapServer egy C-ben írt `nyílt forráskódú <http://www.opensource.org>`_ térinformatikai adatmegjelenítő motor. Az adatok böngészésén túl a MapServer "térinformatikai kép térképek" létrehozását is lehetővé teszi, ez olyan térkép, mely különböző web tartalmakra irányíthatja a felhasználót. Például a Minnesota `DNR Rekreációs iránytű <http://www.dnr.state.mn.us/maps/compass.html>`_ alkalmazás több mint 10,000 weblapot kínál a felhasználóknak, egyetlen alkalmazáson keresztül. Ugyanez az alkalmazás "térkép motorként" szolgálja ki az oldal többi részét és térbeli tartalmat szolgáltat ahol szükséges.

source: MapServer was originally developed by the University of Minnesota (UMN) ForNet project in cooperation with NASA, and the Minnesota Department of Natural Resources (MNDNR). Later it was hosted by the TerraSIP project, a NASA sponsored project between the UMN and a consortium of land management interests.
de: MapServer wurde ursprünglich durch das ForNet Projekt an der Universität von Minnesota (UMN) in Zusammenarbeit mit der NASA und dem Minnesota Department of Natural Resources (MNDNR) entwickelt. Danach wurde MapServer vom NASA-finanzierten TerraSIP-Projekt getragen, in dem die University of Minnesota mit einem Konsortium für Bodenordnung und Landentwicklung zusammenarbeitete.
fr: MapServer a été originellement développé par le projet ForNet de l’Université du Minnesota (UMN) en coopération avec la NASA et le département du Minnesota des Ressources Naturels (MNDNR). Plus tard il a été hébergé par le projet TerraSIP, un projet sponsorisé par la NASA entre l'UMN et un consortium d’organismes de gestion des sols.
hu: A MapServert eredetileg a Minnesota Egyetem (UMN) Természetes Erőforrások tanszékén (MNDNR) fejlesztették, a NASA-val együttműködésben a ForNet projekt keretében. Később a TerraSIP projekt kezelésébe került, melyet a NASA szponzorált és az UMN mellett egy termőföld kezelésben érdekelt konzorcium vett benne részt.

source: MapServer is now a project of `OSGeo <http://www.osgeo.org>`_, and is maintained by a growing number of developers (nearing 20) from around the world. It is supported by a diverse group of organizations that fund enhancements and maintenance, and administered within OSGeo by the MapServer Project Steering Committee made up of developers and other contributors.
de: MapServer ist nun ein Projekt der `OSGeo <http://www.osgeo.org>`_ und wird von einer wachsenden Anzahl an Entwicklern (etwa 20), die weltweit vertreten sind, betreut. Das Projekt wird von diversen Organisationen unterstützt, die die Unterhaltung und Weiterentwicklung unterstützten. MapServer wird innerhalb der OSGeo durch das MapServer Project Steering Committee administriert, das sich aus Entwicklern und engagierten Mitwirkenden zusammensetzt.
fr: MapServer est maintenant un projet de l\'`OSGeo <http://www.osgeo.org>`_, et maintenu par un nombre croissant de développeurs (proche de 20) tout autour du monde. Il est soutenu par un groupe d’organisations diverses qui financent les améliorations et la maintenance, et est administré au sein de l’OSGeo par le Comité de Gouvernance de Projet composé de développeurs et d’autres contributeurs.
hu: Napjainkban az OSGeo egy projektje és a világon mindenfelé megtalálható, növekvő számú fejlesztő (közel 20) tartja karban. A szervezetek sokszínű csoportja biztosít támogatást, alapfejlesztést és karbantartást, az OSGeo-n belüli irányításról a MapServer Projekt Irányító Bizottság gondoskodik, mely fejlesztőkből és közreműködőkből áll.

source: Core Features
de: Kernfunktionen
fr: Caractéristiques principales
hu: Alapfunkciók

source: Advanced cartographic output
de: Leistungsstarke kartographische Ausgabe
fr: Sorties cartographiques avancées
hu: Fejlett térképi kimenet

source: Scale dependent feature drawing and application execution
de: Maßstabsabhängige Anzeige und Anwendungsausführung
fr: Dessin d'objet géographique et exécution de l’application en fonction de l’échelle
hu: Méretarány függő megjelenítés és alkalmazás végrehajtás

source: Feature labeling including label collision mediation
de: Objektbeschriftungen mit Vermeidung von Überlappungen
fr: Étiquetage des géométries incluant la médiation des collisions des étiquettes
hu: Címkézés és címke egybeesés vizsgálat

source: TrueType font support for labeling and symbolization
de: TrueType Schriften zur Beschriftung und Symboldarstellung
fr: Support des polices TrueType pour l'étiquetage et la symbolisation
hu: TrueType font támogatás a címkézéshez és a szimbólumokhoz

source: Map element automation (scalebar, reference map, and legend)
de: Generierung von Kartenelementen (Maßstabsleiste, Referenzkarte, Legende)
fr: Automatisation d’éléments de cartes (barre d’échelle, carte de référence et légende)
hu: Automatikus térkép elemek (lépték vonalzó, áttekintő térkép és jelmagyarázat)

source: Thematic mapping using logical or regular expression-based classes
de: Thematische Karten durch die Nutzung von logischen Klassen oder über reguläre Ausdrücke definierte Klassen
fr: Cartographie thématique en utilisant des classes basées sur des expressions logiques ou des expressions régulières
hu: Tematikus térkép logikai vagy szabályos kifejezés alapján kialakított osztályokra

source: Plugable renderer support with drivers for AGG, Cairo and others
de: Erweiterung um weitere Ausgabeformate durch Treiber für AGG, Cairo, GD und OpenGL und andere
fr: Support de moteur de rendu différents avec des pilotes pour AGG, Cairo et d'autres
hu: Lecserélhető megjelenítő AGG, Cairo, GD, OpenGL és még további meghajtókkal

source: Special provisioning for tiled output generation
de: Spezielle Generierung von Kacheln
fr: Gestion spéciale pour générer des sorties tuilées
hu: Speciális szolgáltatás a csempe output generálásához

source: Mask Layers
de: Maskieren von Ebenen
fr: Couches masque
hu: Maszk rétegek

source: Precise Symbol Placement
de: Präzise Symbolplatzierung
fr: Placement de symbole précis
hu: Pontos szimbólum elhelyezés

source: Complex Multi Label/Symbol Symbology
de: Komplexe Mehrfachbeschriftung/komplexe Symbolik
fr: Symbologie de symboles/étiquettes multiples complexe
hu: Összetett többszörös címke/szimbólum definíciók

source: Vector Fields
de: Vektorfelder
fr: Champs vecteur
hu: Vektor mezők

source: Label Leader Offsetting
fr: Décalage de label via une flèche
hu: Nyilazott címkék

source: SVG Symbology
de: Unterstützung von SVG-Symbolen
fr: Symbologie SVG
hu: SVG szimbólumok

source: Multiple Font Support
de: Unterstützung verschiedener Schriften
fr: Support de polices multiples
hu: Többféle font támogatása

source: Dynamic Heatmaps
de: Dynamische Heatmaps
fr: Carte de chaleurs dynamiques
hu: Dinamikus hőtérképek

source: UTF Grid Support
de: Unterstützung von UTF-Grids
fr: Support UTF Grid
hu: UTF rács támogatás

source: Layer Compositing
fr: Composition de couches
hu: Réteg kompozíció

source: Sophisticated spatial query support
de: Unterstützung anspruchsvoller räumlicher Abfragen
fr: Support de requêtes spatiales sophistiquées
hu: Kifinomult térbeli lekérdezések

source: Identify features by attributes, point, bounding box or geometry across one or more layers
de: Ermittlung von Objekten über Attribute, Punkt, Umgebungsrechteck oder Geometrie über ein oder mehrere Layer hinweg
fr: Identifier les objets par attributs, point, rectangle englobant ou géométrie sur une ou plusieurs couches
hu: Elemek azonosítása attribútum, pont, befoglaló idom vagy geometria alapján, egy vagy több rétegen

source: Support for raster queries
de: Unterstützung von Abfragen auf Rasterdaten
fr: Support pour l'interrogation sur des raster
hu: Raszter lekérdezések

source: Fully customizable, template driven output
de: Vollständig anpassbare vorlagenbasierte Ausgabe
fr: Sortie customisable complétement en s'appuyant sur un sytème de modèle
hu: Teljesen testreszabható sablon alapú kimenet

source: OGR-based query output generation
de: OGR-basierte Ausgabe von Abfrageergebnissen
fr: Génération de sortie basée sur des appels à OGR
hu: OGR alapú lekérdezés kimenet

source: Support for popular scripting and development environments
de: Unterstützung für beliebte scripting und Entwicklungsumgebungen
fr: Support d'environnement de développement et de scriptage populaires
hu: Népszerű szkript és fejlesztő környezetek támogatása

source: PHP, Python, Perl, Ruby, Java, and .NET
de: PHP, Python, Perl, Ruby, Java, und .NET
fr: PHP, Python, Perl, Ruby, Java, et .NET
hu: PHP, Python, Perl, Ruby, Java, és .NET

source: Cross-platform support
de: Betriebssystemübergreifende Unterstützung
fr: Support multi-platesformes
hu: Platform függetlenség

source: Linux, Windows, Mac OS X, Solaris, and more
de: Linux, Windows, Mac OS X, Solaris und mehr
fr: Linux, Windows, Mac OS X, Solaris, et plus
hu: Linux, Windows, Mac OS X, Solaris, és továbbiak

source: A multitude of raster and vector data formats
de: zahlreiche Raster- und Vektordatenformate
fr: Une multitude de formats de données raster et vecteur
hu: Vektor és raszter formátumok sokasága

source: Native support for ESRI shapefiles, PostGIS and Oracle Spatial
de: Native Unterstützung von ESRI Shapes, PostGIS, ESRI ArcSDE und Oracle Spatial
fr: Support natif pour les shapefiles ESRI, PostGIS et Oracle Spatial
hu: Natív támogatás ESRI shape fájl, PostGIS és Oracle Spatial adatforrásokhoz

source: Many other formats via GDAL and OGR
de: Viele andere Formate über GDAL und OGR
fr: De nombreux autres formats via GDAL et OGR
hu: Sok további formátum GDAL és OGR könyvtárakon keresztül

source: Map projection support
de: Karten Umprojektion
fr: Support de projection de carte
hu: Térkép vetületek

source: On-the-fly map projection with 1000s of projections through the Proj.4 library
de: On-the-fly Umprojektion für tausende Projektionen durch die Verwendung der Proj.4 Bibliothek
fr: Reprojection de cartes à la volée avec plusieurs milliers de projections grâce à la bibliothèque Proj.4
hu: Röptében történő vetületi átszámítások több ezer vetület között a Proj.4 könyvtárral

source: Implemented Standards
de: Unterstützte Standards
fr: Standards implémentés
hu: Implementált szabványok

source: Support of numerous Open Geospatial Consortium (OGC) standards
de: Unterstützung zahlreicher Open Geospatial Consortium (OGC) Standards
fr: Support de nombreux standards de l'Open Geospatial Consortium (OGC)
hu: Számos Open Geospatial Consortium (OGC) szabvány támogatása

source: `WMS <http://www.opengeospatial.org/standards/wms>`__ (client/server)
de: `WMS <http://www.opengeospatial.org/standards/wms>`__ (Client und Server)
fr: `WMS <http://www.opengeospatial.org/standards/wms>`__ (client/serveur)
hu: `WMS <http://www.opengeospatial.org/standards/wms>`__ (kliens/szerver)

source: `WFS <http://www.opengeospatial.org/standards/wfs>`__ (non-transactional, client/server)
de: `WFS <http://www.opengeospatial.org/standards/wfs>`__ (nicht-transaktional, Client/Server)
fr: `WFS <http://www.opengeospatial.org/standards/wfs>`__ (non-transactionnel, client/serveur)
hu: `WFS <http://www.opengeospatial.org/standards/wfs>`__ (non-transactional, kliens/szerver)

source: INSPIRE View Service compliant
de: INSPIRE View Service
fr: Conforme au "View Service INSPIRE"

source: Demo
fr: Démo

source: `MapServer 7.0 Documentation <../../../mapserver/doc/index.html>`_
fr: `Documentation MapServer 7.0 <../../../mapserver/doc/index.html>`_
hu: `MapServer 7.0 Dokumentáció <../../../mapserver/doc/index.html>`_

source: Details
fr: Détails
hu: Részletek

source: **Website:** http://www.mapserver.org/
de: **Webseite:** http://www.mapserver.org/
fr: **Site web:** http://www.mapserver.org/
hu: **Honlap:** http://www.mapserver.org/

source: **Licence:** `MIT-style license <http://mapserver.org/copyright.html#license>`_
de: **Lizenz:** `MIT-style license <http://mapserver.org/copyright.html#license>`_
fr: **Licence:** `Licence style MIT <http://mapserver.org/copyright.html#license>`_
hu: **Licenc:** `MIT-style licenc <http://mapserver.org/copyright.html#license>`_

source: **Software Version:** |version-mapserver|
fr: **Version du logiciel:** |version-mapserver|
hu: **Szoftver verzió:** |version-mapserver|

source: **Supported Platforms:** Windows, Linux, Mac
de: **Unterstützte Plattformen:** Windows, Linux, Mac
fr: **Plates-formes supportées:** Windows, Linux, Mac
hu: **Támogatott platformok:** Windows, Linux, Mac

source: **API Interfaces:** C, PHP, Python, Perl, Ruby, Java, and .NET
de: **API Schnittstellen:** C, PHP, Python, Perl, Ruby, Java, and .NET
fr: **Interfaces de l'API:** C, PHP, Python, Perl, Ruby, Java, and .NET
hu: **API Interfészek:** C, PHP, Python, Perl, Ruby, Java, és .NET

source: Quickstart
de: Schnellstart
fr: Guide de démarrage rapide
hu: Gyorstalpaló

source: :doc:`Quickstart documentation <../quickstart/mapserver_quickstart>`
de: :doc:`Quickstart Dokumentation <../quickstart/mapserver_quickstart>`
fr: :doc:`Documentation du guide de démarrage rapide <../quickstart/mapserver_quickstart>`
hu: :doc:`Gyorstalpaló dokumentáció <../quickstart/mapserver_quickstart>`

source: Documentation
de: Dokumentation
hu: Dokumentáció

source: **Support:** http://mapserver.org/community/
hu: **Támogatás:** http://mapserver.org/community/
