Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/ncWMS_overview.po
Languages: fr

source: ncWMS publishes multi-dimensional data (such as environmental and weather data) as an OGC compliant Web Map Service (WMS). ncWMS quickly and efficiently extracts the map images from the very large data files typically associated with environmental data.
fr: ncWMS publie des données multidimensionnelles (telles que des données environnementales et météorologiques) sous la forme d'un service de cartographie Web conforme à l'OGC (WMS). Le ncWMS extrait rapidement et efficacement les images cartographiques à partir des très gros fichiers de données généralement associés aux données environnementales.

source: Core Features
fr: Caractéristiques principales

source: Fast extraction of data
fr: Extraction de données rapide

source: Generation of timeseries and vertical profile plots
fr: Génération de séries temporelles et diagrammes de profils verticaux

source: Ability to plot data along a transect
fr: Capacité à dessiner de la donnée, le long d'un transect

source: Automatic recognition of vector-components and generation of vector arrows
fr: Reconnaissance automatique de composants vecteur et génération de flèches vecteur

source: Support for a large range of projections (for both source data and target images)
fr: Prise en charge d'un large éventail de projections (pour les données sources et les images cibles)

source: Support for creating animations
fr: Support pour la création d'animations

source: Browser client included
fr: Client web inclus

source: Support for export to Google Earth KML format
fr: Support pour l'export vers le format Google Earth KML

source: Input formats: NetCDF, GRIB, OPeNDAP
fr: Formats d'entrée: NetCDF, GRIB, OPeNDAP

source: Output formats: PNG, JPEG, animated GIF, KML
fr: Formats de sortie: PNG, JPEG, GIF animé, KML

source: Implemented Standards
fr: Standards implémentés

source: Details
fr: Détails

source: **Website:** https://github.com/Reading-eScience-Centre/ncwms
fr: **Site web:** https://github.com/Reading-eScience-Centre/ncwms

source: **Licence:** `Modified BSD License <https://github.com/Reading-eScience-Centre/ncwms/releases/download/ncwms-2.2.8/licence.txt>`_
fr: **Licence:** `Licence BSD modifiée <https://github.com/Reading-eScience-Centre/ncwms/releases/download/ncwms-2.2.8/licence.txt>`_

source: **Software Version:** |version-ncWMS|
fr: **Version du logiciel:** |version-ncWMS|

source: **Supported Platforms:** All Java 1.8 platforms: Windows, Linux, Mac
fr: **Plates-formes supportées:** Toutes les plates-formes Java 1.8: Windows, Linux, Mac

source: **API Interfaces:** Java; WMS
fr: **Interface d'API:** Java; WMS

source: Quickstart
fr: Guide de démarrage rapide

source: :doc:`Quickstart documentation <../quickstart/ncWMS_quickstart>`
fr: :doc:`Documentation du guide de démarrage rapide <../quickstart/ncWMS_quickstart>`
