Repository: johanvdw/OSGeoLive-doc
Catalog: locale/*/LC_MESSAGES/overview/ossim_overview.po
Languages: de, es, fr, hu

source: Image Processing
de: Bilddatenverarbeitung
es: Procesamiento de Imágenes
fr: Traitement d'images
hu: Képfeldolgozás

source: Open Source Software Image Map (OSSIM) is a high performance engine for remote sensing, image processing, geographical information system and photogrammetry.
de: Open Source Software Image Map (OSSIM) ist ein äußerst mächtiges Werkzeug für Aufgaben im Bereich der Fernerkundung, Bildverarbeitung, Geographischen Informationssysteme und Photogrammetrie.
es: Mapa de Imagen de Software de Código Abierto (OSSIM poor sus siglas en inglés) es un motor de alto rendimiento para detección remota, procesamiento de imágenes, sistema de información geográfica y fotogrametría.
fr: Open Source Software Image Map (OSSIM) est un outil très performant pour la télédétection, le traitement de l'image, l'information géographique et la photogrammétrie.
hu: Open Source Software Image Map (OSSIM) egy nagy teljesítményű motor távérzékeléshez, képfeldolgozáshoz, térinformatikai rendszerhez és fotogrammetriához.

source: OSSIM has been funded by several US government agencies in the intelligence and defense community and the technology is currently deployed in research and operational sites. It has been actively developed since 1996.
de: OSSIM wurde durch mehrere US-Regierungsbehörden aus dem Bereich der Nachrichtendienste und der Verteidigung gefördert, und die Technologie wird derzeit in der Forschung als auch im operativen Betrieb eingesetzt. Die Software wird aktiv seit 1996 entwickelt.
es: OSSIM ha sido financiado por varias agencias de gobierno de los Estados Unidos en la comunidad de inteligencia y defensa y la tecnología se implementa actualmente en investigación y sitios operativos. Se ha desarrollado activamente desde 1996.
fr: OSSIM a été financé par plusieurs agences gouvernementales américaines dans la communauté du renseignement et de la défense. Cette technologie est actuellement déployée pour la recherche et en situation opérationnelle. Il a été activement développé depuis 1996.
hu: Az OSSIM-et számos amerikai kormány ügynökség finanszírozta a titkosszolgálati és védelmi területről és a technológiát a kutatási és operatív területekre telepítik. 1996 óta aktívan fejlesztik.

source: Designed as a series of high performance software libraries, it is written in C++ employing the latest techniques in object-oriented software design. Many command line utilities, GUI applications, and integrated systems have been implemented - several of which are included with the software distribution.
de: Konzipiert als eine Reihe von leistungsstarken Software-Bibliotheken, ist die Software in C++ geschrieben und macht Gebrauch von neuesten Techniken im Bereich objektorientierten Designs. Zahlreiche Befehlszeilen-Werkzeuge, GUI-Anwendungen und integrierte Systeme wurden entwickelt - von denen mehrere in dem Softwarepaket enthalten sind.
es: Diseñado como una serie de bibliotecas de software de alto rendimiento, está escrito en C++ utilizando las últimas técnicas en diseño de software orientado a objetos. Se han implementado muchas utilidades de línea de comandos, aplicaciones GUI y sistemas integrados, muchas de las cuales se incluyen con la distribución del software.
fr: Conçu comme une série de bibliothèques logicielles haute performance, il est écrit en C++ utilisant les dernières techniques en matière de conception de logiciels orientés objet. Il embarque de nombreux utilitaires de ligne de commande, des interfaces graphiques et des systèmes intégrés ont été implémentés - plusieurs d'entre eux sont inclus avec la distribution logicielle.
hu: Nagy hatékonyságú szoftver könyvtárak sorozataként tervezték meg, C++ nyelven írták az objektum orientált szoftver tervezés legújabb technikáinak alkalmazásával. Sok parancssori segédprogramot, grafikus alkalmazást és integrált rendszert implementáltak - számosat közülük belefoglaltak a szoftver kiadásba.

source: Core Features
de: Kernfunktionen
es: Características Principales
fr: Caractéristiques principales
hu: Alapfunkciók

source: Parallel processing capabilites with mpi libraries
de: Fähigkeit zur parallelen Verarbeitung mit MPI-Bibliotheken
es: Capacidades de procesamiento en paralelo con bibliotecas mpi
fr: Processus de parallélisation avec la librairie mpi
hu: Párhuzamos feldolgozási képességek mpi könyvtárakkal

source: Rigorous sensor modeling
de: Strenge Sensor-Modellierung
es: Modelado riguroso de sensores
fr: Modélisation des capteurs rigoureuse
hu: Szigorú szenzor modellezés

source: Universal Sensor Models (RPCs)
de: Universelle Sensor-Modelle (RPCs)
es: Modelos Universales de Sensores (RPC)
hu: Univerzális szenzormodellek (RPCs)

source: Wide range of Map Projections and Datums supported
de: Weitreichende Unterstützung von Kartenprojektionen und Bezugssystemen
es: Amplia gama de Proyecciones de Mapa y Datums compatibles
fr: Une vaste gamme de projections cartographiques et de datum est supportée
hu: Térképi vetületek és dátumok széles skáláját támogatják

source: Non-destructive, parameter based image chains
de: Non-destruktive, parameter-basierte Bildreihen
es: Parámetro no destructivo, basado en cadenas de imagen
fr: Chaînes d'images basées sur des paramètres, non destructive
hu: Nem változtató, paraméter alapú kép láncok

source: Native file access
de: Nativer Dateizugriff
es: Acceso a archivos nativos
fr: Accès de fichiers natifs
hu: Natív fájl hozzáférés

source: Precision Terrain correction and ortho-rectification
de: Präzise Geländekorrektur und Orthorektifizierung
es: Corrección de Precisión de Terreno y Orto rectificación
fr: Correction de terrain de précision et ortho-rectification
hu: Pontos terep korrekció és orto-javítás

source: Advanced Mosaicing, compositing and fusions
de: Erweiterte Verfahren zu Mosaik, Überlagerung und Verschmelzen
es: Mosaico Avanzado, composición y fusiones
fr: Mosaïquage, composition et fusions avancées
hu: Haladó mozaik készítés, összerakás és egyesítés

source: Elevation support
de: Unterstützung von Höhenangaben
es: Soporte de elevación
fr: Support de l'élévation
hu: Magasság kezelés

source: Vector and shapelib support
de: Vektor und shapelib Unterstützung
es: apoyo a vector y shapelib
fr: Support de shapelib et de vecteur
hu: Vektor és shapelib támogatás

source: Projection and resolution independent
de: Unabhängigkeit von Projektion und Auflösung
es: Proyección y resolución independiente
fr: Projection et résolution indépendantes
hu: Vetület és felbontás független

source: Equation editors
de: Formeleditoren
es: Editores de la ecuación
fr: Éditeurs d'équation
hu: Egyenlet szerkesztő

source: Details
es: Detalles
fr: Détails
hu: Részletek

source: **Website:** http://www.ossim.org
de: **Webseite:** http://www.ossim.org
es: **Sitio web:** http://www.ossim.org
fr: **Site web:** http://www.ossim.org
hu: **Honlap:** http://www.ossim.org

source: **Licence:** GNU General Public License (GPL) version 3
de: **Lizenz:** GNU General Public License (GPL) version 3
es: **Licencia:** GNU General Public License (GPL) version 3
hu: **Licenc:** GNU General Public License (GPL) version 3

source: **Software Version:** |version-ossim|
es: **Versión de software:** |version-ossim|
fr: **Version du logiciel:** |version-ossim|
hu: **Szoftver verzió:** |version-ossim|

source: **Supported Platforms:** Linux, Mac, Windows
de: **Unterstützte Plattformen:** Linux, Mac, Windows
es: **Plataformas compatibles:** GNU/Linux, Mac OSX, MS Windows
fr: **Plates-formes supportées:** Linux, Mac, Windows
hu: **Támogatott platformok:** Linux, Mac, Windows

source: **API Interfaces:** C++
de: **API Schnittstellen:** C++
es: **Interfaces API:** C++
fr: **Interface de l'API:** C++
hu: **API interfészek:** C++

source: **Commercial Support:** http://www.osgeo.org/search_profile
de: **Kommerzieller Support:** http://www.osgeo.org/search_profile
es: **Soporte comercial:** http://www.osgeo.org/search_profile
fr: **Support commercial:** http://www.osgeo.org/search_profile
hu: **Kereskedelmi támogatás:** http://www.osgeo.org/search_profile

source: Quickstart
de: Schnellstart
es: Inicio Rápido
fr: Guide de démarrage rapide
hu: Gyorstalpaló

source: :doc:`Quickstart documentation <../quickstart/ossim_quickstart>`
de: :doc:`Quickstart Dokumentation <../quickstart/ossim_quickstart>`
es: :doc:`Documentación de inicio rápido <../quickstart/ossim_quickstart>`
fr: :doc:`Documentation du guide de démarrage rapide <../quickstart/ossim_quickstart>`
hu: :doc:`Gyorstalpaló dokumentáció <../quickstart/ossim_quickstart>`
